<abi-corpus version='2.2' soname='libandroid.so'>
  <elf-needed>
    <dependency name='liblog.so'/>
    <dependency name='libhidlbase.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libandroidfw.so'/>
    <dependency name='libinput.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libbinder.so'/>
    <dependency name='libui.so'/>
    <dependency name='libgui.so'/>
    <dependency name='libharfbuzz_ng.so'/>
    <dependency name='libsensor.so'/>
    <dependency name='libandroid_runtime.so'/>
    <dependency name='libminikin.so'/>
    <dependency name='libnetd_client.so'/>
    <dependency name='libhwui.so'/>
    <dependency name='libxml2.so'/>
    <dependency name='android.hardware.configstore@1.0.so'/>
    <dependency name='android.hardware.configstore-utils.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AAssetDir_close' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAssetDir_getNextFileName' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='ASurfaceTransaction_setZOrder' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_close' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_next' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_open' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_beginAsyncSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_beginSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_endAsyncSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_endSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_isEnabled' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_setCounter' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_getaddrinfofornetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_cancel' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nquery' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nresult' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nsend' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_setprocnetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_setsocknetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/IMountService.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='560' id='5da7196d'>
      <subrange length='35' lower-bound='0' upper-bound='34' type-id='7ff19f0f' id='6e6845b5'/>
    </array-type-def>
    <pointer-type-def type-id='22d61b29' size-in-bits='32' id='9892ee61'/>
    <pointer-type-def type-id='7807f886' size-in-bits='32' id='27ec51bc'/>
    <qualified-type-def type-id='9cb9149f' const='yes' id='dee60e2c'/>
    <reference-type-def kind='lvalue' type-id='dee60e2c' size-in-bits='32' id='ee2819be'/>
    <reference-type-def kind='lvalue' type-id='9cb9149f' size-in-bits='32' id='705b9f3b'/>
    <reference-type-def kind='lvalue' type-id='26924198' size-in-bits='32' id='763d7e1a'/>
    <pointer-type-def type-id='6807f016' size-in-bits='32' id='ba5970bc'/>
    <reference-type-def kind='lvalue' type-id='a2aa88e3' size-in-bits='32' id='cab8cdd7'/>
    <reference-type-def kind='rvalue' type-id='a2aa88e3' size-in-bits='32' id='11ec3263'/>
    <pointer-type-def type-id='a2aa88e3' size-in-bits='32' id='beb8baf3'/>
    <reference-type-def kind='lvalue' type-id='3f075162' size-in-bits='32' id='4cb59d14'/>
    <reference-type-def kind='rvalue' type-id='3f075162' size-in-bits='32' id='f3e675b6'/>
    <pointer-type-def type-id='3f075162' size-in-bits='32' id='40b58a30'/>
    <qualified-type-def type-id='bf075117' const='yes' id='d11f779a'/>
    <pointer-type-def type-id='d11f779a' size-in-bits='32' id='e4896a10'/>
    <qualified-type-def type-id='6807f016' const='yes' id='6cf1e15d'/>
    <reference-type-def kind='lvalue' type-id='6cf1e15d' size-in-bits='32' id='fbc5f4a1'/>
    <qualified-type-def type-id='a2aa88e3' const='yes' id='e2905de8'/>
    <reference-type-def kind='lvalue' type-id='e2905de8' size-in-bits='32' id='7743ab4a'/>
    <pointer-type-def type-id='e2905de8' size-in-bits='32' id='6b439866'/>
    <qualified-type-def type-id='3f075162' const='yes' id='1a6371f3'/>
    <reference-type-def kind='lvalue' type-id='1a6371f3' size-in-bits='32' id='5f8c324f'/>
    <pointer-type-def type-id='1a6371f3' size-in-bits='32' id='638c389b'/>
    <qualified-type-def type-id='452328e6' const='yes' id='08f75d23'/>
    <pointer-type-def type-id='08f75d23' size-in-bits='32' id='2667752b'/>
    <qualified-type-def type-id='5ddaf272' const='yes' id='0cbf5aab'/>
    <pointer-type-def type-id='0cbf5aab' size-in-bits='32' id='923b7913'/>
    <qualified-type-def type-id='a1aaab37' const='yes' id='5649c4ec'/>
    <pointer-type-def type-id='5649c4ec' size-in-bits='32' id='9c20c3b2'/>
    <qualified-type-def type-id='e4c905b6' const='yes' id='0f556883'/>
    <reference-type-def kind='lvalue' type-id='0f556883' size-in-bits='32' id='c873bbbf'/>
    <pointer-type-def type-id='0f556883' size-in-bits='32' id='cc73c20b'/>
    <qualified-type-def type-id='34e3553c' const='yes' id='9d0984bf'/>
    <reference-type-def kind='lvalue' type-id='9d0984bf' size-in-bits='32' id='cefbbcdb'/>
    <pointer-type-def type-id='9d0984bf' size-in-bits='32' id='cafbb68f'/>
    <qualified-type-def type-id='4547cff8' const='yes' id='fc5a3b88'/>
    <reference-type-def kind='lvalue' type-id='fc5a3b88' size-in-bits='32' id='f00bf2ea'/>
    <pointer-type-def type-id='4aafb922' size-in-bits='32' id='9aa04798'/>
    <reference-type-def kind='lvalue' type-id='452328e6' size-in-bits='32' id='84e43118'/>
    <pointer-type-def type-id='452328e6' size-in-bits='32' id='80e42acc'/>
    <pointer-type-def type-id='5ddaf272' size-in-bits='32' id='606e1a50'/>
    <pointer-type-def type-id='a1aaab37' size-in-bits='32' id='97e1a22f'/>
    <reference-type-def kind='lvalue' type-id='e4c905b6' size-in-bits='32' id='55daf9c8'/>
    <pointer-type-def type-id='e4c905b6' size-in-bits='32' id='51daf37c'/>
    <reference-type-def kind='lvalue' type-id='34e3553c' size-in-bits='32' id='ef24a0d6'/>
    <reference-type-def kind='rvalue' type-id='34e3553c' size-in-bits='32' id='66a959d0'/>
    <pointer-type-def type-id='34e3553c' size-in-bits='32' id='fb24b3ba'/>
    <reference-type-def kind='lvalue' type-id='4547cff8' size-in-bits='32' id='ff242d41'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='32' id='822cd80b'/>
    <pointer-type-def type-id='df458ae6' size-in-bits='32' id='621ed18c'/>
    <pointer-type-def type-id='edff7cb3' size-in-bits='32' id='b5a5bc13'/>
    <pointer-type-def type-id='40b6343a' size-in-bits='32' id='6d5a3b78'/>
    <reference-type-def kind='lvalue' type-id='748cb1b7' size-in-bits='32' id='d7c9afdb'/>
    <pointer-type-def type-id='748cb1b7' size-in-bits='32' id='d3c9a98f'/>
    <reference-type-def kind='lvalue' type-id='60976dc0' size-in-bits='32' id='bb0cd27a'/>
    <pointer-type-def type-id='60976dc0' size-in-bits='32' id='af0cbf96'/>
    <namespace-decl name='android'>
      <class-decl name='BpInterface&lt;android::IMountService&gt;' size-in-bits='224' visibility='default' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='86' column='1' id='22d61b29'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bf075117'/>
        <base-class access='public' layout-offset-in-bits='32' type-id='df458ae7'/>
        <member-function access='public'>
          <function-decl name='BpInterface' mangled-name='_ZN7android11BpInterfaceINS_13IMountServiceEEC2ERKNS_2spINS_7IBinderEEE' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='89' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9892ee61' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='2'>
          <function-decl name='onAsBinder' mangled-name='_ZN7android11BpInterfaceINS_13IMountServiceEE10onAsBinderEv' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='93' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9892ee61' is-artificial='yes'/>
            <return type-id='b5a5bc13'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpMountService' size-in-bits='224' visibility='default' filepath='frameworks/base/libs/storage/IMountService.cpp' line='55' column='1' id='7807f886'>
        <base-class access='public' layout-offset-in-bits='0' type-id='22d61b29'/>
        <member-function access='public' constructor='yes'>
          <function-decl name='BpMountService' mangled-name='_ZN7android14BpMountServiceC1ERKNS_2spINS_7IBinderEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='58' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='registerListener' mangled-name='_ZN7android14BpMountService16registerListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='63' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='unregisterListener' mangled-name='_ZN7android14BpMountService18unregisterListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='79' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='isUsbMassStorageConnected' mangled-name='_ZN7android14BpMountService25isUsbMassStorageConnectedEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='95' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='7'>
          <function-decl name='setUsbMassStorageEnabled' mangled-name='_ZN7android14BpMountService24setUsbMassStorageEnabledEb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='111' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='8'>
          <function-decl name='isUsbMassStorageEnabled' mangled-name='_ZN7android14BpMountService23isUsbMassStorageEnabledEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='127' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='9'>
          <function-decl name='mountVolume' mangled-name='_ZN7android14BpMountService11mountVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='143' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='10'>
          <function-decl name='unmountVolume' mangled-name='_ZN7android14BpMountService13unmountVolumeERKNS_8String16Ebb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='160' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='11'>
          <function-decl name='formatVolume' mangled-name='_ZN7android14BpMountService12formatVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='179' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='12'>
          <function-decl name='getStorageUsers' mangled-name='_ZN7android14BpMountService15getStorageUsersERKNS_8String16EPPi' filepath='frameworks/base/libs/storage/IMountService.cpp' line='196' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='9aa04798'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='13'>
          <function-decl name='getVolumeState' mangled-name='_ZN7android14BpMountService14getVolumeStateERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='225' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='14'>
          <function-decl name='createSecureContainer' mangled-name='_ZN7android14BpMountService21createSecureContainerERKNS_8String16EiS3_S3_i' filepath='frameworks/base/libs/storage/IMountService.cpp' line='242' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='15'>
          <function-decl name='finalizeSecureContainer' mangled-name='_ZN7android14BpMountService23finalizeSecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='264' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='16'>
          <function-decl name='destroySecureContainer' mangled-name='_ZN7android14BpMountService22destroySecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='281' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='17'>
          <function-decl name='mountSecureContainer' mangled-name='_ZN7android14BpMountService20mountSecureContainerERKNS_8String16ES3_i' filepath='frameworks/base/libs/storage/IMountService.cpp' line='298' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='18'>
          <function-decl name='unmountSecureContainer' mangled-name='_ZN7android14BpMountService22unmountSecureContainerERKNS_8String16Eb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='319' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='19'>
          <function-decl name='isSecureContainerMounted' mangled-name='_ZN7android14BpMountService24isSecureContainerMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='337' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='20'>
          <function-decl name='renameSecureContainer' mangled-name='_ZN7android14BpMountService21renameSecureContainerERKNS_8String16ES3_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='354' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='21'>
          <function-decl name='getSecureContainerPath' mangled-name='_ZN7android14BpMountService22getSecureContainerPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='372' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='22'>
          <function-decl name='getSecureContainerList' mangled-name='_ZN7android14BpMountService22getSecureContainerListERKNS_8String16ERPS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='390' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='763d7e1a'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='23'>
          <function-decl name='shutdown' mangled-name='_ZN7android14BpMountService8shutdownERKNS_2spINS_22IMountShutdownObserverEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='412' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='24'>
          <function-decl name='finishMediaUpdate' mangled-name='_ZN7android14BpMountService17finishMediaUpdateEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='429' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='25'>
          <function-decl name='mountObb' mangled-name='_ZN7android14BpMountService8mountObbERKNS_8String16ES3_S3_RKNS_2spINS_18IObbActionListenerEEEiRKNS4_INS_7ObbInfoEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='445' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='0c3db078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='26'>
          <function-decl name='unmountObb' mangled-name='_ZN7android14BpMountService10unmountObbERKNS_8String16EbRKNS_2spINS_18IObbActionListenerEEEi' filepath='frameworks/base/libs/storage/IMountService.cpp' line='467' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='27'>
          <function-decl name='isObbMounted' mangled-name='_ZN7android14BpMountService12isObbMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='487' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='28'>
          <function-decl name='getMountedObbPath' mangled-name='_ZN7android14BpMountService17getMountedObbPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='504' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='29'>
          <function-decl name='decryptStorage' mangled-name='_ZN7android14BpMountService14decryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='522' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='30'>
          <function-decl name='encryptStorage' mangled-name='_ZN7android14BpMountService14encryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='539' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IMountService' size-in-bits='96' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='32' column='1' id='bf075117'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343b'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' mangled-name='_ZN7android13IMountService10descriptorE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='default_impl' type-id='34e3553c' mangled-name='_ZN7android13IMountService12default_implE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='IMountService' mangled-name='_ZN7android13IMountServiceC2Ev' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='asInterface' mangled-name='_ZN7android13IMountService11asInterfaceERKNS_2spINS_7IBinderEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='83dafb9a'/>
            <return type-id='f331f373'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='setDefaultImpl' mangled-name='_ZN7android13IMountService14setDefaultImplENSt3__110unique_ptrIS0_NS1_14default_deleteIS0_EEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='34e3553c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='getDefaultImpl' mangled-name='_ZN7android13IMountService14getDefaultImplEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <return type-id='cefbbcdb'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' mangled-name='_ZN7android13IMountServiceD0Ev' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='getInterfaceDescriptor' mangled-name='_ZNK7android13IMountService22getInterfaceDescriptorEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e4896a10' is-artificial='yes'/>
            <return type-id='157d4f95'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='registerListener' mangled-name='_ZN7android13IMountService16registerListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='36' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='unregisterListener' mangled-name='_ZN7android13IMountService18unregisterListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='38' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='isUsbMassStorageConnected' mangled-name='_ZN7android13IMountService25isUsbMassStorageConnectedEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='39' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='7'>
          <function-decl name='setUsbMassStorageEnabled' mangled-name='_ZN7android13IMountService24setUsbMassStorageEnabledEb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='8'>
          <function-decl name='isUsbMassStorageEnabled' mangled-name='_ZN7android13IMountService23isUsbMassStorageEnabledEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='9'>
          <function-decl name='mountVolume' mangled-name='_ZN7android13IMountService11mountVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='10'>
          <function-decl name='unmountVolume' mangled-name='_ZN7android13IMountService13unmountVolumeERKNS_8String16Ebb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='11'>
          <function-decl name='formatVolume' mangled-name='_ZN7android13IMountService12formatVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='12'>
          <function-decl name='getStorageUsers' mangled-name='_ZN7android13IMountService15getStorageUsersERKNS_8String16EPPi' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='9aa04798'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='13'>
          <function-decl name='getVolumeState' mangled-name='_ZN7android13IMountService14getVolumeStateERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='14'>
          <function-decl name='createSecureContainer' mangled-name='_ZN7android13IMountService21createSecureContainerERKNS_8String16EiS3_S3_i' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='49' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='15'>
          <function-decl name='finalizeSecureContainer' mangled-name='_ZN7android13IMountService23finalizeSecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='52' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='16'>
          <function-decl name='destroySecureContainer' mangled-name='_ZN7android13IMountService22destroySecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='53' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='17'>
          <function-decl name='mountSecureContainer' mangled-name='_ZN7android13IMountService20mountSecureContainerERKNS_8String16ES3_i' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='18'>
          <function-decl name='unmountSecureContainer' mangled-name='_ZN7android13IMountService22unmountSecureContainerERKNS_8String16Eb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='57' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='19'>
          <function-decl name='isSecureContainerMounted' mangled-name='_ZN7android13IMountService24isSecureContainerMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='58' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='20'>
          <function-decl name='renameSecureContainer' mangled-name='_ZN7android13IMountService21renameSecureContainerERKNS_8String16ES3_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='59' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='21'>
          <function-decl name='getSecureContainerPath' mangled-name='_ZN7android13IMountService22getSecureContainerPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='61' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='22'>
          <function-decl name='getSecureContainerList' mangled-name='_ZN7android13IMountService22getSecureContainerListERKNS_8String16ERPS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='62' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='763d7e1a'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='23'>
          <function-decl name='shutdown' mangled-name='_ZN7android13IMountService8shutdownERKNS_2spINS_22IMountShutdownObserverEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='64' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='24'>
          <function-decl name='finishMediaUpdate' mangled-name='_ZN7android13IMountService17finishMediaUpdateEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='65' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='25'>
          <function-decl name='mountObb' mangled-name='_ZN7android13IMountService8mountObbERKNS_8String16ES3_S3_RKNS_2spINS_18IObbActionListenerEEEiRKNS4_INS_7ObbInfoEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='66' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='0c3db078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='26'>
          <function-decl name='unmountObb' mangled-name='_ZN7android13IMountService10unmountObbERKNS_8String16EbRKNS_2spINS_18IObbActionListenerEEEi' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='69' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='27'>
          <function-decl name='isObbMounted' mangled-name='_ZN7android13IMountService12isObbMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='71' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='28'>
          <function-decl name='getMountedObbPath' mangled-name='_ZN7android13IMountService17getMountedObbPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='72' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='29'>
          <function-decl name='decryptStorage' mangled-name='_ZN7android13IMountService14decryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='73' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='30'>
          <function-decl name='encryptStorage' mangled-name='_ZN7android13IMountService14encryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='74' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IMountServiceListener&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='a2aa88e3'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='d3c9a98f' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <parameter type-id='d3c9a98f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <parameter type-id='11ec3263'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IMountShutdownObserver&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='3f075162'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='af0cbf96' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <parameter type-id='af0cbf96'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <parameter type-id='f3e675b6'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpRefBase' visibility='default' is-declaration-only='yes' id='df458ae6'>
        <member-function access='protected'>
          <function-decl name='remote' mangled-name='_ZN7android9BpRefBase6remoteEv' filepath='frameworks/native/libs/binder/include/binder/Binder.h' line='114' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='621ed18c' is-artificial='yes'/>
            <return type-id='b5a5bc13'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IBinder' visibility='default' is-declaration-only='yes' id='edff7cb3'/>
      <class-decl name='IInterface' visibility='default' is-declaration-only='yes' id='40b6343a'/>
      <class-decl name='IMountServiceListener' visibility='default' is-declaration-only='yes' id='748cb1b7'/>
      <class-decl name='IMountShutdownObserver' visibility='default' is-declaration-only='yes' id='60976dc0'/>
      <class-decl name='IObbActionListener' size-in-bits='96' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='27' column='1' id='f7c5ae1e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343c'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' mangled-name='_ZN7android18IObbActionListener10descriptorE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='default_impl' type-id='c722890a' mangled-name='_ZN7android18IObbActionListener12default_implE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='IObbActionListener' mangled-name='_ZN7android18IObbActionListenerC2Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='asInterface' mangled-name='_ZN7android18IObbActionListener11asInterfaceERKNS_2spINS_7IBinderEEE' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='83dafb9a'/>
            <return type-id='92343ec8'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='setDefaultImpl' mangled-name='_ZN7android18IObbActionListener14setDefaultImplENSt3__110unique_ptrIS0_NS1_14default_deleteIS0_EEEE' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c722890a'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='getDefaultImpl' mangled-name='_ZN7android18IObbActionListener14getDefaultImplEv' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <return type-id='fcd3f6e5'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD0Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='getInterfaceDescriptor' mangled-name='_ZNK7android18IObbActionListener22getInterfaceDescriptorEv' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='32d2f295' is-artificial='yes'/>
            <return type-id='157d4f95'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='onObbResult' mangled-name='_ZN7android18IObbActionListener11onObbResultERKNS_8String16Eii' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='ObbInfo' size-in-bits='288' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='27' column='1' id='65c10d3d'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f8f7e309'/>
        <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mFileName' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='38' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='mPackageName' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='39' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='mVersion' type-id='3ff5601b' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='40' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='mFlags' type-id='3ff5601b' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='41' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='160'>
          <var-decl name='mSaltSize' type-id='b59d7dce' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='42' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='mSalt' type-id='9f7200cf' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='43' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='ObbInfo' mangled-name='_ZN7android7ObbInfoC1ENS_8String16ES1_iijPKh' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <parameter type-id='a3cec311'/>
            <parameter type-id='a3cec311'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='b59d7dce'/>
            <parameter type-id='9f7200cf'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD0Ev' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='writeToParcel' mangled-name='_ZNK7android7ObbInfo13writeToParcelEPNS_6ParcelE' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a5f3e61a' is-artificial='yes'/>
            <parameter type-id='1a1ddb91'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='readFromParcel' mangled-name='_ZN7android7ObbInfo14readFromParcelEPKNS_6ParcelE' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='35' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <parameter type-id='79927164'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
      </class-decl>
      <typedef-decl name='status_t' type-id='3ff5601b' filepath='system/core/libutils/include/utils/Errors.h' line='30' column='1' id='a5a046cd'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='__compressed_pair&lt;android::IMountService *, std::__1::default_delete&lt;android::IMountService&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2211' column='1' id='452328e6'>
          <base-class access='private' layout-offset-in-bits='0' type-id='5ddaf272'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='a1aaab37'/>
        </class-decl>
        <class-decl name='unique_ptr&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2401' column='1' id='34e3553c'>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='e4c905b6' filepath='external/libcxx/include/memory' line='2404' column='1' id='4547cff8'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='4d462c84' filepath='external/libcxx/include/memory' line='2405' column='1' id='0504b995'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='452328e6' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='unique_ptr' filepath='external/libcxx/include/memory' line='2494' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='fb24b3ba' is-artificial='yes'/>
              <parameter type-id='66a959d0'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~unique_ptr' mangled-name='_ZNSt3__110unique_ptrIN7android13IMountServiceENS_14default_deleteIS2_EEED2Ev' filepath='external/libcxx/include/memory' line='2606' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='fb24b3ba' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='reset' mangled-name='_ZNSt3__110unique_ptrIN7android13IMountServiceENS_14default_deleteIS2_EEE5resetEPS2_' filepath='external/libcxx/include/memory' line='2648' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='fb24b3ba' is-artificial='yes'/>
              <parameter type-id='0504b995'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator bool' mangled-name='_ZNKSt3__110unique_ptrIN7android13IMountServiceENS_14default_deleteIS2_EEEcvbEv' filepath='external/libcxx/include/memory' line='2636' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='cafbb68f' is-artificial='yes'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='release' mangled-name='_ZNSt3__110unique_ptrIN7android13IMountServiceENS_14default_deleteIS2_EEE7releaseEv' filepath='external/libcxx/include/memory' line='2641' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='fb24b3ba' is-artificial='yes'/>
              <return type-id='0504b995'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator=' mangled-name='_ZNSt3__110unique_ptrIN7android13IMountServiceENS_14default_deleteIS2_EEEaSEOS5_' filepath='external/libcxx/include/memory' line='2517' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='fb24b3ba' is-artificial='yes'/>
              <parameter type-id='66a959d0'/>
              <return type-id='ef24a0d6'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__add_lvalue_reference_impl&lt;android::IMountService, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/type_traits' line='1125' column='1' id='0503b309'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='a0b91aeb' filepath='external/libcxx/include/type_traits' line='1125' column='1' id='4d462c85'/>
          </member-type>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;android::IMountService *, 0, false&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2134' column='1' id='5ddaf272'>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='ee2819be' filepath='external/libcxx/include/memory' line='2137' column='1' id='63812cad'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='705b9f3b' filepath='external/libcxx/include/memory' line='2136' column='1' id='3a142961'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='9cb9149f' visibility='default' filepath='external/libcxx/include/memory' line='2168' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2140' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='606e1a50' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::IMountService&gt;, 1, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2172' column='1' id='a1aaab37'>
          <base-class access='private' layout-offset-in-bits='0' type-id='e4c905b6'/>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='c873bbbf' filepath='external/libcxx/include/memory' line='2175' column='1' id='63812cae'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='55daf9c8' filepath='external/libcxx/include/memory' line='2174' column='1' id='3a142962'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2179' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='97e1a22f' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__pointer_type&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1029' column='1' id='5c33a3c6'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='4d462c86' filepath='external/libcxx/include/memory' line='1031' column='1' id='4d462c84'/>
          </member-type>
        </class-decl>
        <class-decl name='add_lvalue_reference&lt;android::IMountService&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/type_traits' line='1127' column='1' id='12435004'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='4d462c85' filepath='external/libcxx/include/type_traits' line='1128' column='1' id='4d462c87'/>
          </member-type>
        </class-decl>
        <class-decl name='default_delete&lt;android::IMountService&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2320' column='1' id='e4c905b6'>
          <member-function access='public'>
            <function-decl name='default_delete' filepath='external/libcxx/include/memory' line='2324' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='51daf37c' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator()' mangled-name='_ZNKSt3__114default_deleteIN7android13IMountServiceEEclEPS2_' filepath='external/libcxx/include/memory' line='2334' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='cc73c20b' is-artificial='yes'/>
              <parameter type-id='9cb9149f'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='27619c1c'/>
        <namespace-decl name='__pointer_type_imp'>
          <class-decl name='__pointer_type&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1021' column='1' id='a5b82b2c'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='9cb9149f' filepath='external/libcxx/include/memory' line='1023' column='1' id='4d462c86'/>
            </member-type>
          </class-decl>
        </namespace-decl>
        <typedef-decl name='string' type-id='27619c1c' filepath='external/libcxx/include/iosfwd' line='211' column='1' id='763f758d'/>
      </namespace-decl>
    </namespace-decl>
    <class-decl name='__sFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='8d7b2c1e'/>
    <function-decl name='iswalnum' filepath='bionic/libc/include/bits/wctype.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswalpha' filepath='bionic/libc/include/bits/wctype.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswblank' filepath='bionic/libc/include/bits/wctype.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswcntrl' filepath='bionic/libc/include/bits/wctype.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswdigit' filepath='bionic/libc/include/bits/wctype.h' line='44' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswgraph' filepath='bionic/libc/include/bits/wctype.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswlower' filepath='bionic/libc/include/bits/wctype.h' line='46' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswprint' filepath='bionic/libc/include/bits/wctype.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswpunct' filepath='bionic/libc/include/bits/wctype.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswspace' filepath='bionic/libc/include/bits/wctype.h' line='49' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswupper' filepath='bionic/libc/include/bits/wctype.h' line='50' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='iswxdigit' filepath='bionic/libc/include/bits/wctype.h' line='51' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='towlower' filepath='bionic/libc/include/bits/wctype.h' line='53' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='towupper' filepath='bionic/libc/include/bits/wctype.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='wctype' filepath='bionic/libc/include/bits/wctype.h' line='57' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='ba50424d'/>
    </function-decl>
    <function-decl name='iswctype' filepath='bionic/libc/include/bits/wctype.h' line='58' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <parameter type-id='ba50424d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <typedef-decl name='wctrans_t' type-id='eaa32e2f' filepath='bionic/libc/include/bits/wctype.h' line='60' column='1' id='183c72c3'/>
    <function-decl name='towctrans' filepath='bionic/libc/include/bits/wctype.h' line='61' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <parameter type-id='183c72c3'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='wctrans' filepath='bionic/libc/include/bits/wctype.h' line='62' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='183c72c3'/>
    </function-decl>
    <function-decl name='malloc' filepath='bionic/libc/include/malloc.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='calloc' filepath='bionic/libc/include/malloc.h' line='52' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='realloc' filepath='bionic/libc/include/malloc.h' line='61' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='free' filepath='bionic/libc/include/malloc.h' line='79' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <typedef-decl name='FILE' type-id='8d7b2c1e' filepath='bionic/libc/include/stdio.h' line='59' column='1' id='aa12d1ba'/>
    <function-decl name='clearerr' filepath='bionic/libc/include/stdio.h' line='106' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='fclose' filepath='bionic/libc/include/stdio.h' line='107' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='feof' filepath='bionic/libc/include/stdio.h' line='108' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ferror' filepath='bionic/libc/include/stdio.h' line='109' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fflush' filepath='bionic/libc/include/stdio.h' line='110' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fgetc' filepath='bionic/libc/include/stdio.h' line='111' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fprintf' filepath='bionic/libc/include/stdio.h' line='113' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fputc' filepath='bionic/libc/include/stdio.h' line='114' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fputs' filepath='bionic/libc/include/stdio.h' line='115' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fscanf' filepath='bionic/libc/include/stdio.h' line='117' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getc' filepath='bionic/libc/include/stdio.h' line='119' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getchar' filepath='bionic/libc/include/stdio.h' line='120' column='1' visibility='default' binding='global' size-in-bits='32'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='perror' filepath='bionic/libc/include/stdio.h' line='124' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='printf' filepath='bionic/libc/include/stdio.h' line='125' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putc' filepath='bionic/libc/include/stdio.h' line='126' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='putchar' filepath='bionic/libc/include/stdio.h' line='127' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='puts' filepath='bionic/libc/include/stdio.h' line='128' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='remove' filepath='bionic/libc/include/stdio.h' line='129' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='rewind' filepath='bionic/libc/include/stdio.h' line='130' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='scanf' filepath='bionic/libc/include/stdio.h' line='131' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='setbuf' filepath='bionic/libc/include/stdio.h' line='132' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='26a90f95'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='setvbuf' filepath='bionic/libc/include/stdio.h' line='133' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='26a90f95'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='sscanf' filepath='bionic/libc/include/stdio.h' line='134' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ungetc' filepath='bionic/libc/include/stdio.h' line='135' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vfprintf' filepath='bionic/libc/include/stdio.h' line='136' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vprintf' filepath='bionic/libc/include/stdio.h' line='137' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='tmpnam' filepath='bionic/libc/include/stdio.h' line='162' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='26a90f95'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='rename' filepath='bionic/libc/include/stdio.h' line='174' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fseek' filepath='bionic/libc/include/stdio.h' line='215' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='95e97e5f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ftell' filepath='bionic/libc/include/stdio.h' line='216' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5f'/>
    </function-decl>
    <function-decl name='fgetpos' filepath='bionic/libc/include/stdio.h' line='232' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='c5f12884'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fsetpos' filepath='bionic/libc/include/stdio.h' line='233' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='3b76d94f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fopen' filepath='bionic/libc/include/stdio.h' line='256' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='freopen' filepath='bionic/libc/include/stdio.h' line='258' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='822cd80b'/>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='tmpfile' filepath='bionic/libc/include/stdio.h' line='260' column='1' visibility='default' binding='global' size-in-bits='32'>
      <return type-id='822cd80b'/>
    </function-decl>
    <function-decl name='vfscanf' filepath='bionic/libc/include/stdio.h' line='264' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vscanf' filepath='bionic/libc/include/stdio.h' line='265' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vsscanf' filepath='bionic/libc/include/stdio.h' line='267' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='abort' filepath='bionic/libc/include/stdlib.h' line='44' column='1' visibility='default' binding='global' size-in-bits='32'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='exit' filepath='bionic/libc/include/stdlib.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='_Exit' filepath='bionic/libc/include/stdlib.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='atexit' filepath='bionic/libc/include/stdlib.h' line='52' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='953b12f8'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='at_quick_exit' filepath='bionic/libc/include/stdlib.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='953b12f8'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='quick_exit' filepath='bionic/libc/include/stdlib.h' line='55' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='getenv' filepath='bionic/libc/include/stdlib.h' line='57' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strtol' filepath='bionic/libc/include/stdlib.h' line='75' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5f'/>
    </function-decl>
    <function-decl name='strtoll' filepath='bionic/libc/include/stdlib.h' line='76' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e60'/>
    </function-decl>
    <function-decl name='strtoul' filepath='bionic/libc/include/stdlib.h' line='77' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='strtoull' filepath='bionic/libc/include/stdlib.h' line='78' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='f0981eec'/>
    </function-decl>
    <function-decl name='strtod' filepath='bionic/libc/include/stdlib.h' line='84' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='atoi' filepath='bionic/libc/include/stdlib.h' line='89' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='atol' filepath='bionic/libc/include/stdlib.h' line='90' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5f'/>
    </function-decl>
    <function-decl name='atoll' filepath='bionic/libc/include/stdlib.h' line='91' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e60'/>
    </function-decl>
    <function-decl name='system' filepath='bionic/libc/include/stdlib.h' line='94' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='bsearch' filepath='bionic/libc/include/stdlib.h' line='96' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='585e1de9'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='qsort' filepath='bionic/libc/include/stdlib.h' line='98' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='585e1de9'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='ldiv' filepath='bionic/libc/include/stdlib.h' line='141' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5f'/>
      <parameter type-id='95e97e5f'/>
      <return type-id='30397bf8'/>
    </function-decl>
    <function-decl name='lldiv' filepath='bionic/libc/include/stdlib.h' line='148' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e60'/>
      <parameter type-id='95e97e60'/>
      <return type-id='f5fa3b34'/>
    </function-decl>
    <function-decl name='mblen' filepath='bionic/libc/include/stdlib.h' line='163' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='bionic/libc/include/stdlib.h' line='164' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='mbtowc' filepath='bionic/libc/include/stdlib.h' line='165' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wctomb' filepath='bionic/libc/include/stdlib.h' line='166' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='c523b9f1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wcstombs' filepath='bionic/libc/include/stdlib.h' line='168' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='labs' filepath='bionic/libc/include/stdlib.h' line='188' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5f'/>
      <return type-id='95e97e5f'/>
    </function-decl>
    <function-decl name='llabs' filepath='bionic/libc/include/stdlib.h' line='189' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e60'/>
      <return type-id='95e97e60'/>
    </function-decl>
    <function-decl name='strtof' filepath='bionic/libc/include/stdlib.h' line='195' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='9b23c9ad'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='atof' filepath='bionic/libc/include/stdlib.h' line='196' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='rand' filepath='bionic/libc/include/stdlib.h' line='197' column='1' visibility='default' binding='global' size-in-bits='32'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='srand' filepath='bionic/libc/include/stdlib.h' line='198' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='memcmp' filepath='bionic/libc/include/string.h' line='52' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strcmp' filepath='bionic/libc/include/string.h' line='78' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strtok' filepath='bionic/libc/include/string.h' line='91' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strerror' filepath='bionic/libc/include/string.h' line='94' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='strncmp' filepath='bionic/libc/include/string.h' line='105' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strcspn' filepath='bionic/libc/include/string.h' line='112' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='strspn' filepath='bionic/libc/include/string.h' line='115' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='strcoll' filepath='bionic/libc/include/string.h' line='119' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='strxfrm' filepath='bionic/libc/include/string.h' line='120' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='time' filepath='bionic/libc/include/time.h' line='62' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='b2eb2c3f'/>
      <return type-id='c9d12d66'/>
    </function-decl>
    <function-decl name='asctime' filepath='bionic/libc/include/time.h' line='65' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='d6ad37ff'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='difftime' filepath='bionic/libc/include/time.h' line='68' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='c9d12d66'/>
      <parameter type-id='c9d12d66'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='mktime' filepath='bionic/libc/include/time.h' line='69' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='d915a820'/>
      <return type-id='c9d12d66'/>
    </function-decl>
    <function-decl name='localtime' filepath='bionic/libc/include/time.h' line='71' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='9f201474'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='gmtime' filepath='bionic/libc/include/time.h' line='74' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='9f201474'/>
      <return type-id='d915a820'/>
    </function-decl>
    <function-decl name='strftime' filepath='bionic/libc/include/time.h' line='80' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='d6ad37ff'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='ctime' filepath='bionic/libc/include/time.h' line='87' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='9f201474'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='clock' filepath='bionic/libc/include/time.h' line='92' column='1' visibility='default' binding='global' size-in-bits='32'>
      <return type-id='4c3a2c61'/>
    </function-decl>
    <function-decl name='btowc' filepath='bionic/libc/include/wchar.h' line='46' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='95e97e5e'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='fwprintf' filepath='bionic/libc/include/wchar.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='f077d3f8'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fwscanf' filepath='bionic/libc/include/wchar.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='f077d3f8'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fgetwc' filepath='bionic/libc/include/wchar.h' line='49' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='fgetws' filepath='bionic/libc/include/wchar.h' line='50' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='822cd80b'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='fputwc' filepath='bionic/libc/include/wchar.h' line='51' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='c523b9f1'/>
      <parameter type-id='822cd80b'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='fputws' filepath='bionic/libc/include/wchar.h' line='52' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='822cd80b'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='fwide' filepath='bionic/libc/include/wchar.h' line='53' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='getwc' filepath='bionic/libc/include/wchar.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='getwchar' filepath='bionic/libc/include/wchar.h' line='55' column='1' visibility='default' binding='global' size-in-bits='32'>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='mbsinit' filepath='bionic/libc/include/wchar.h' line='56' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='5d006ebf'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='mbrlen' filepath='bionic/libc/include/wchar.h' line='57' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='a68021ce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='mbrtowc' filepath='bionic/libc/include/wchar.h' line='58' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='a68021ce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='mbsrtowcs' filepath='bionic/libc/include/wchar.h' line='59' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='7d3cd834'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='a68021ce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='putwc' filepath='bionic/libc/include/wchar.h' line='61' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='c523b9f1'/>
      <parameter type-id='822cd80b'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='putwchar' filepath='bionic/libc/include/wchar.h' line='62' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='c523b9f1'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='swprintf' filepath='bionic/libc/include/wchar.h' line='63' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='f077d3f8'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='swscanf' filepath='bionic/libc/include/wchar.h' line='64' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='f077d3f8'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='ungetwc' filepath='bionic/libc/include/wchar.h' line='65' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <parameter type-id='822cd80b'/>
      <return type-id='6dd37369'/>
    </function-decl>
    <function-decl name='vfwprintf' filepath='bionic/libc/include/wchar.h' line='66' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vfwscanf' filepath='bionic/libc/include/wchar.h' line='67' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vswprintf' filepath='bionic/libc/include/wchar.h' line='68' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vswscanf' filepath='bionic/libc/include/wchar.h' line='69' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vwprintf' filepath='bionic/libc/include/wchar.h' line='70' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='vwscanf' filepath='bionic/libc/include/wchar.h' line='71' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='2aee9912'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wcrtomb' filepath='bionic/libc/include/wchar.h' line='74' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='c523b9f1'/>
      <parameter type-id='a68021ce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='wcscat' filepath='bionic/libc/include/wchar.h' line='77' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='f077d3f8'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='wcscmp' filepath='bionic/libc/include/wchar.h' line='79' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='f077d3f8'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='bionic/libc/include/wchar.h' line='80' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='f077d3f8'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='bionic/libc/include/wchar.h' line='81' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='f077d3f8'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='wcscspn' filepath='bionic/libc/include/wchar.h' line='82' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='f077d3f8'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='bionic/libc/include/wchar.h' line='83' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='d6ad37ff'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='wcslen' filepath='bionic/libc/include/wchar.h' line='85' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='wcsncat' filepath='bionic/libc/include/wchar.h' line='88' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='wcsncmp' filepath='bionic/libc/include/wchar.h' line='89' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wcsncpy' filepath='bionic/libc/include/wchar.h' line='90' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='wcsrtombs' filepath='bionic/libc/include/wchar.h' line='94' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='26a90f95'/>
      <parameter type-id='5ea27396'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='a68021ce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='wcsspn' filepath='bionic/libc/include/wchar.h' line='95' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='f077d3f8'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='wcstod' filepath='bionic/libc/include/wchar.h' line='97' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='01efdaf1'/>
      <return type-id='a0eb0f08'/>
    </function-decl>
    <function-decl name='wcstof' filepath='bionic/libc/include/wchar.h' line='99' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='01efdaf1'/>
      <return type-id='a6c45d85'/>
    </function-decl>
    <function-decl name='wcstok' filepath='bionic/libc/include/wchar.h' line='101' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='01efdaf1'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='wcstol' filepath='bionic/libc/include/wchar.h' line='102' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='01efdaf1'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5f'/>
    </function-decl>
    <function-decl name='wcstoll' filepath='bionic/libc/include/wchar.h' line='104' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='01efdaf1'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e60'/>
    </function-decl>
    <function-decl name='wcstoul' filepath='bionic/libc/include/wchar.h' line='106' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='01efdaf1'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='f0981eeb'/>
    </function-decl>
    <function-decl name='wcstoull' filepath='bionic/libc/include/wchar.h' line='108' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='01efdaf1'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='f0981eec'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='bionic/libc/include/wchar.h' line='110' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='wctob' filepath='bionic/libc/include/wchar.h' line='111' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='6dd37369'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wmemcmp' filepath='bionic/libc/include/wchar.h' line='114' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wmemcpy' filepath='bionic/libc/include/wchar.h' line='115' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='wmemmove' filepath='bionic/libc/include/wchar.h' line='119' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='f077d3f8'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='wmemset' filepath='bionic/libc/include/wchar.h' line='120' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='323d93c1'/>
      <parameter type-id='c523b9f1'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='323d93c1'/>
    </function-decl>
    <function-decl name='wprintf' filepath='bionic/libc/include/wchar.h' line='121' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='wscanf' filepath='bionic/libc/include/wchar.h' line='122' column='1' visibility='default' binding='global' size-in-bits='32'>
      <parameter type-id='f077d3f8'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='32' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/IObbActionListener.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='608' id='19b37a54'>
      <subrange length='38' lower-bound='0' upper-bound='37' type-id='7ff19f0f' id='aa4ccdac'/>
    </array-type-def>
    <pointer-type-def type-id='b4c0d64f' size-in-bits='32' id='36e31287'/>
    <pointer-type-def type-id='3224f91e' size-in-bits='32' id='e09894a4'/>
    <pointer-type-def type-id='af342359' size-in-bits='32' id='e1c45961'/>
    <qualified-type-def type-id='c70198d4' const='yes' id='a48c009f'/>
    <reference-type-def kind='lvalue' type-id='a48c009f' size-in-bits='32' id='c165233b'/>
    <reference-type-def kind='lvalue' type-id='c70198d4' size-in-bits='32' id='3983c4f6'/>
    <pointer-type-def type-id='6a14bf2f' size-in-bits='32' id='6ec90c77'/>
    <qualified-type-def type-id='f7c5ae1e' const='yes' id='79f4741d'/>
    <pointer-type-def type-id='79f4741d' size-in-bits='32' id='32d2f295'/>
    <qualified-type-def type-id='6a14bf2f' const='yes' id='eae5dbc4'/>
    <reference-type-def kind='lvalue' type-id='eae5dbc4' size-in-bits='32' id='a9d924c6'/>
    <qualified-type-def type-id='9a8c82c0' const='yes' id='589f2895'/>
    <pointer-type-def type-id='589f2895' size-in-bits='32' id='418d24ad'/>
    <qualified-type-def type-id='15f35f71' const='yes' id='5d62d332'/>
    <pointer-type-def type-id='5d62d332' size-in-bits='32' id='1a924ec8'/>
    <qualified-type-def type-id='17e76a52' const='yes' id='91a7fe13'/>
    <pointer-type-def type-id='91a7fe13' size-in-bits='32' id='847533bb'/>
    <qualified-type-def type-id='0de0b2fb' const='yes' id='990dfc58'/>
    <reference-type-def kind='lvalue' type-id='990dfc58' size-in-bits='32' id='6f047a5a'/>
    <pointer-type-def type-id='990dfc58' size-in-bits='32' id='63046776'/>
    <qualified-type-def type-id='c722890a' const='yes' id='3e775081'/>
    <reference-type-def kind='lvalue' type-id='3e775081' size-in-bits='32' id='fcd3f6e5'/>
    <pointer-type-def type-id='3e775081' size-in-bits='32' id='00d3fd31'/>
    <qualified-type-def type-id='4547cff9' const='yes' id='fc5a3b89'/>
    <reference-type-def kind='lvalue' type-id='fc5a3b89' size-in-bits='32' id='f00bf2eb'/>
    <reference-type-def kind='lvalue' type-id='9a8c82c0' size-in-bits='32' id='83c15dea'/>
    <pointer-type-def type-id='9a8c82c0' size-in-bits='32' id='77c14b06'/>
    <pointer-type-def type-id='15f35f71' size-in-bits='32' id='10cb6749'/>
    <pointer-type-def type-id='17e76a52' size-in-bits='32' id='1e283db0'/>
    <reference-type-def kind='lvalue' type-id='0de0b2fb' size-in-bits='32' id='b43a7bff'/>
    <pointer-type-def type-id='0de0b2fb' size-in-bits='32' id='b83a824b'/>
    <reference-type-def kind='lvalue' type-id='c722890a' size-in-bits='32' id='cfba356c'/>
    <reference-type-def kind='rvalue' type-id='c722890a' size-in-bits='32' id='4c21e37e'/>
    <pointer-type-def type-id='c722890a' size-in-bits='32' id='d3ba3bb8'/>
    <reference-type-def kind='lvalue' type-id='4547cff9' size-in-bits='32' id='ff242d42'/>
    <pointer-type-def type-id='aa12d1bb' size-in-bits='32' id='822cd80c'/>
    <pointer-type-def type-id='df458ae7' size-in-bits='32' id='621ed18d'/>
    <pointer-type-def type-id='edff7cb4' size-in-bits='32' id='b5a5bc14'/>
    <pointer-type-def type-id='40b6343b' size-in-bits='32' id='6d5a3b79'/>
    <pointer-type-def type-id='b5977877' size-in-bits='32' id='0657c1ff'/>
    <pointer-type-def type-id='a87dbeee' size-in-bits='32' id='ce9e5ae4'/>
    <pointer-type-def type-id='259563fa' size-in-bits='32' id='e7293458'/>
    <qualified-type-def type-id='783cc678' const='yes' id='44c384ef'/>
    <qualified-type-def type-id='8fc19046' const='yes' id='d452635d'/>
    <pointer-type-def type-id='d452635d' size-in-bits='32' id='b4b29455'/>
    <qualified-type-def type-id='63080be8' const='yes' id='75a1230f'/>
    <qualified-type-def type-id='dff69842' const='yes' id='5be53127'/>
    <qualified-type-def type-id='b04db2dd' const='yes' id='00633158'/>
    <qualified-type-def type-id='7bb1d8e1' const='yes' id='0e59eb20'/>
    <qualified-type-def type-id='606d2805' const='yes' id='cbdbf7d2'/>
    <qualified-type-def type-id='359485b5' const='yes' id='53334ee2'/>
    <qualified-type-def type-id='2a92430d' const='yes' id='b80399ca'/>
    <qualified-type-def type-id='23f2d06f' const='yes' id='dcc28adc'/>
    <qualified-type-def type-id='8c662fc5' const='yes' id='4db497f2'/>
    <qualified-type-def type-id='482d220b' const='yes' id='06ffb900'/>
    <qualified-type-def type-id='6ba1fceb' const='yes' id='eb2629cc'/>
    <qualified-type-def type-id='3f8702cf' const='yes' id='37aad5fa'/>
    <qualified-type-def type-id='560c92f7' const='yes' id='12d46c22'/>
    <qualified-type-def type-id='49eccd9d' const='yes' id='f53b94fe'/>
    <qualified-type-def type-id='a3295715' const='yes' id='d73e162a'/>
    <qualified-type-def type-id='763f758e' const='yes' id='17a746bd'/>
    <qualified-type-def type-id='427e4b8a' const='yes' id='1dd04bd9'/>
    <qualified-type-def type-id='82a684ba' const='yes' id='03a9204f'/>
    <qualified-type-def type-id='b54229ce' const='yes' id='e1f2fe13'/>
    <qualified-type-def type-id='ff70dc94' const='yes' id='c508b1b1'/>
    <qualified-type-def type-id='0e839744' const='yes' id='95bfe8d1'/>
    <qualified-type-def type-id='cdd69b5c' const='yes' id='fbb12461'/>
    <qualified-type-def type-id='b9fa8f40' const='yes' id='2533de45'/>
    <qualified-type-def type-id='5417a89c' const='yes' id='8fa83ea9'/>
    <qualified-type-def type-id='2f680da0' const='yes' id='224503c5'/>
    <qualified-type-def type-id='9360eadc' const='yes' id='3e9fa921'/>
    <qualified-type-def type-id='a3eca172' const='yes' id='4f54b247'/>
    <qualified-type-def type-id='444756ca' const='yes' id='4729bdff'/>
    <qualified-type-def type-id='9c9ad7b0' const='yes' id='14d1d5fd'/>
    <qualified-type-def type-id='cab02d1c' const='yes' id='99b40a09'/>
    <qualified-type-def type-id='d5fd3ca7' const='yes' id='8dba978e'/>
    <qualified-type-def type-id='4de8320f' const='yes' id='de6e0290'/>
    <qualified-type-def type-id='45e7b03b' const='yes' id='1733cb18'/>
    <qualified-type-def type-id='aa688d0f' const='yes' id='14b1b7ea'/>
    <qualified-type-def type-id='8e24268f' const='yes' id='3e60ea5a'/>
    <qualified-type-def type-id='9f0bbb87' const='yes' id='330d96aa'/>
    <qualified-type-def type-id='255041c5' const='yes' id='5ae3c360'/>
    <qualified-type-def type-id='3c4ae4e9' const='yes' id='e0150e18'/>
    <qualified-type-def type-id='46767cd5' const='yes' id='d8498116'/>
    <namespace-decl name='android'>
      <class-decl name='BnObbActionListener' size-in-bits='192' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='37' column='1' id='b4c0d64f'>
        <base-class access='public' layout-offset-in-bits='0' type-id='2144ef38'/>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='onTransact' mangled-name='_ZN7android19BnObbActionListener10onTransactEjRKNS_6ParcelEPS1_j' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='36e31287' is-artificial='yes'/>
            <parameter type-id='8f92235e'/>
            <parameter type-id='6d925e80'/>
            <parameter type-id='1a1ddb91'/>
            <parameter type-id='8f92235e'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpInterface&lt;android::IObbActionListener&gt;' size-in-bits='224' visibility='default' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='86' column='1' id='3224f91e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f7c5ae1e'/>
        <base-class access='public' layout-offset-in-bits='32' type-id='df458ae7'/>
        <member-function access='public'>
          <function-decl name='BpInterface' mangled-name='_ZN7android11BpInterfaceINS_18IObbActionListenerEEC2ERKNS_2spINS_7IBinderEEE' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='89' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e09894a4' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='2'>
          <function-decl name='onAsBinder' mangled-name='_ZN7android11BpInterfaceINS_18IObbActionListenerEE10onAsBinderEv' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='93' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e09894a4' is-artificial='yes'/>
            <return type-id='b5a5bc14'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpObbActionListener' size-in-bits='224' visibility='default' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='27' column='1' id='af342359'>
        <base-class access='public' layout-offset-in-bits='0' type-id='3224f91e'/>
        <member-function access='public' constructor='yes'>
          <function-decl name='BpObbActionListener' mangled-name='_ZN7android19BpObbActionListenerC1ERKNS_2spINS_7IBinderEEE' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='29' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c45961' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='onObbResult' mangled-name='_ZN7android19BpObbActionListener11onObbResultERKNS_8String16Eii' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c45961' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IObbActionListener' size-in-bits='96' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='27' column='1' id='f7c5ae1e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343c'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' mangled-name='_ZN7android18IObbActionListener10descriptorE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='default_impl' type-id='c722890a' mangled-name='_ZN7android18IObbActionListener12default_implE' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='IObbActionListener' mangled-name='_ZN7android18IObbActionListenerC2Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='asInterface' mangled-name='_ZN7android18IObbActionListener11asInterfaceERKNS_2spINS_7IBinderEEE' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='83dafb9a'/>
            <return type-id='92343ec8'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='setDefaultImpl' mangled-name='_ZN7android18IObbActionListener14setDefaultImplENSt3__110unique_ptrIS0_NS1_14default_deleteIS0_EEEE' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c722890a'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' static='yes'>
          <function-decl name='getDefaultImpl' mangled-name='_ZN7android18IObbActionListener14getDefaultImplEv' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <return type-id='fcd3f6e5'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD0Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='getInterfaceDescriptor' mangled-name='_ZNK7android18IObbActionListener22getInterfaceDescriptorEv' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='32d2f295' is-artificial='yes'/>
            <return type-id='157d4f95'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='onObbResult' mangled-name='_ZN7android18IObbActionListener11onObbResultERKNS_8String16Eii' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpRefBase' visibility='default' is-declaration-only='yes' id='df458ae7'>
        <member-function access='protected'>
          <function-decl name='remote' mangled-name='_ZN7android9BpRefBase6remoteEv' filepath='frameworks/native/libs/binder/include/binder/Binder.h' line='114' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='621ed18d' is-artificial='yes'/>
            <return type-id='b5a5bc14'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IBinder' visibility='default' is-declaration-only='yes' id='edff7cb4'/>
      <class-decl name='IInterface' visibility='default' is-declaration-only='yes' id='40b6343b'/>
      <class-decl name='IPCThreadState' visibility='default' is-declaration-only='yes' id='b5977877'/>
      <class-decl name='Parcelable' size-in-bits='32' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='35' column='1' id='f8f7e309'>
        <member-function access='public' constructor='yes'>
          <function-decl name='Parcelable' mangled-name='_ZN7android10ParcelableC2Ev' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='39' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Parcelable' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <parameter type-id='769dcc84'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Parcelable' mangled-name='_ZN7android10ParcelableD0Ev' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='37' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='writeToParcel' mangled-name='_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='6a9db9a0' is-artificial='yes'/>
            <parameter type-id='1a1ddb91'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='readFromParcel' mangled-name='_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <parameter type-id='79927164'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='isStable' mangled-name='_ZNK7android10Parcelable8isStableEv' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='60' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='6a9db9a0' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='TextOutput' visibility='default' is-declaration-only='yes' id='32215dca'/>
      <namespace-decl name='base'>
        <typedef-decl name='unique_fd' type-id='bd6f4e31' filepath='system/libbase/include/android-base/unique_fd.h' line='178' column='1' id='c8068786'/>
      </namespace-decl>
      <class-decl name='flat_binder_object' is-struct='yes' visibility='default' is-declaration-only='yes' id='8fc19046'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='__compressed_pair&lt;android::IObbActionListener *, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2211' column='1' id='9a8c82c0'>
          <base-class access='private' layout-offset-in-bits='0' type-id='15f35f71'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='17e76a52'/>
        </class-decl>
        <class-decl name='unique_ptr&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2401' column='1' id='c722890a'>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='0de0b2fb' filepath='external/libcxx/include/memory' line='2404' column='1' id='4547cff9'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='4d462c88' filepath='external/libcxx/include/memory' line='2405' column='1' id='0504b996'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='9a8c82c0' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='unique_ptr' filepath='external/libcxx/include/memory' line='2494' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <parameter type-id='4c21e37e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~unique_ptr' mangled-name='_ZNSt3__110unique_ptrIN7android18IObbActionListenerENS_14default_deleteIS2_EEED2Ev' filepath='external/libcxx/include/memory' line='2606' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='reset' mangled-name='_ZNSt3__110unique_ptrIN7android18IObbActionListenerENS_14default_deleteIS2_EEE5resetEPS2_' filepath='external/libcxx/include/memory' line='2648' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <parameter type-id='0504b996'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator bool' mangled-name='_ZNKSt3__110unique_ptrIN7android18IObbActionListenerENS_14default_deleteIS2_EEEcvbEv' filepath='external/libcxx/include/memory' line='2636' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='00d3fd31' is-artificial='yes'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='release' mangled-name='_ZNSt3__110unique_ptrIN7android18IObbActionListenerENS_14default_deleteIS2_EEE7releaseEv' filepath='external/libcxx/include/memory' line='2641' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <return type-id='0504b996'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator=' mangled-name='_ZNSt3__110unique_ptrIN7android18IObbActionListenerENS_14default_deleteIS2_EEEaSEOS5_' filepath='external/libcxx/include/memory' line='2517' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <parameter type-id='4c21e37e'/>
              <return type-id='cfba356c'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__add_lvalue_reference_impl&lt;android::IObbActionListener, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/type_traits' line='1125' column='1' id='9ce38486'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='bb0185f0' filepath='external/libcxx/include/type_traits' line='1125' column='1' id='4d462c89'/>
          </member-type>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;android::IObbActionListener *, 0, false&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2134' column='1' id='15f35f71'>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='c165233b' filepath='external/libcxx/include/memory' line='2137' column='1' id='63812caf'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='3983c4f6' filepath='external/libcxx/include/memory' line='2136' column='1' id='3a142963'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='c70198d4' visibility='default' filepath='external/libcxx/include/memory' line='2168' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2140' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='10cb6749' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::IObbActionListener&gt;, 1, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2172' column='1' id='17e76a52'>
          <base-class access='private' layout-offset-in-bits='0' type-id='0de0b2fb'/>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='6f047a5a' filepath='external/libcxx/include/memory' line='2175' column='1' id='63812cb0'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='b43a7bff' filepath='external/libcxx/include/memory' line='2174' column='1' id='3a142964'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2179' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='1e283db0' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__pointer_type&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1029' column='1' id='4ef6f3a4'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='4d462c8a' filepath='external/libcxx/include/memory' line='1031' column='1' id='4d462c88'/>
          </member-type>
        </class-decl>
        <class-decl name='add_lvalue_reference&lt;android::IObbActionListener&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/type_traits' line='1127' column='1' id='12c60191'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='4d462c89' filepath='external/libcxx/include/type_traits' line='1128' column='1' id='4d462c8b'/>
          </member-type>
        </class-decl>
        <class-decl name='default_delete&lt;android::IObbActionListener&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2320' column='1' id='0de0b2fb'>
          <member-function access='public'>
            <function-decl name='default_delete' filepath='external/libcxx/include/memory' line='2324' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b83a824b' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator()' mangled-name='_ZNKSt3__114default_deleteIN7android18IObbActionListenerEEclEPS2_' filepath='external/libcxx/include/memory' line='2334' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='63046776' is-artificial='yes'/>
              <parameter type-id='c70198d4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='27619c1d'/>
        <class-decl name='optional&lt;android::String16&gt;' visibility='default' is-declaration-only='yes' id='63080be8'/>
        <class-decl name='optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='dff69842'/>
        <class-decl name='optional&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b04db2dd'/>
        <class-decl name='optional&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='7bb1d8e1'/>
        <class-decl name='optional&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='606d2805'/>
        <class-decl name='optional&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='359485b5'/>
        <class-decl name='optional&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='2a92430d'/>
        <class-decl name='optional&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='23f2d06f'/>
        <class-decl name='optional&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='8c662fc5'/>
        <class-decl name='optional&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='482d220b'/>
        <class-decl name='optional&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='6ba1fceb'/>
        <class-decl name='optional&lt;std::__1::vector&lt;std::__1::optional&lt;android::String16&gt;, std::__1::allocator&lt;std::__1::optional&lt;android::String16&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='3f8702cf'/>
        <class-decl name='optional&lt;std::__1::vector&lt;std::__1::optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt;, std::__1::allocator&lt;std::__1::optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='560c92f7'/>
        <class-decl name='optional&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='49eccd9d'/>
        <class-decl name='optional&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='a3295715'/>
        <class-decl name='unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;' visibility='default' is-declaration-only='yes' id='427e4b8a'/>
        <class-decl name='unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2401' column='1' id='ee11ffd6'>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='523e1257' filepath='external/libcxx/include/memory' line='2404' column='1' id='4547cffa'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='4d462c8c' filepath='external/libcxx/include/memory' line='2405' column='1' id='0504b997'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='dc8bc990' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='unique_ptr' filepath='external/libcxx/include/memory' line='2494' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='7d0d8c7c' is-artificial='yes'/>
              <parameter type-id='165e4caa'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~unique_ptr' mangled-name='_ZNSt3__110unique_ptrINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_14default_deleteIS6_EEED2Ev' filepath='external/libcxx/include/memory' line='2606' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='7d0d8c7c' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='unique_ptr&lt;true, void&gt;' mangled-name='_ZNSt3__110unique_ptrINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_14default_deleteIS6_EEEC2ILb1EvEEv' filepath='external/libcxx/include/memory' line='2461' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='7d0d8c7c' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='reset' mangled-name='_ZNSt3__110unique_ptrINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_14default_deleteIS6_EEE5resetEPS6_' filepath='external/libcxx/include/memory' line='2648' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='7d0d8c7c' is-artificial='yes'/>
              <parameter type-id='0504b997'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='operator bool' mangled-name='_ZNKSt3__110unique_ptrINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEENS_14default_deleteIS6_EEEcvbEv' filepath='external/libcxx/include/memory' line='2636' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0fdc8ffb' is-artificial='yes'/>
              <return type-id='c894953d'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='82a684ba'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b54229ce'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='ff70dc94'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='0e839744'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='cdd69b5c'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b9fa8f40'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='5417a89c'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='2f680da0'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='9360eadc'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='a3eca172'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='444756ca'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='9c9ad7b0'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='cab02d1c'/>
        <class-decl name='vector&lt;android::String16, std::__1::allocator&lt;android::String16&gt; &gt;' visibility='default' is-declaration-only='yes' id='d5fd3ca7'/>
        <class-decl name='vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='4de8320f'/>
        <class-decl name='vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='45e7b03b'/>
        <class-decl name='vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt;' visibility='default' is-declaration-only='yes' id='aa688d0f'/>
        <class-decl name='vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt;' visibility='default' is-declaration-only='yes' id='8e24268f'/>
        <class-decl name='vector&lt;double, std::__1::allocator&lt;double&gt; &gt;' visibility='default' is-declaration-only='yes' id='9f0bbb87'/>
        <class-decl name='vector&lt;float, std::__1::allocator&lt;float&gt; &gt;' visibility='default' is-declaration-only='yes' id='255041c5'/>
        <class-decl name='vector&lt;int, std::__1::allocator&lt;int&gt; &gt;' size-in-bits='96' visibility='default' filepath='external/libcxx/include/vector' line='470' column='1' id='21156a1f'>
          <base-class access='private' layout-offset-in-bits='0' type-id='ccc1a701'/>
          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='b57f8f12' filepath='external/libcxx/include/vector' line='486' column='1' id='b57f8f11'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='63812cb2' filepath='external/libcxx/include/vector' line='482' column='1' id='63812cb1'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='0504b999' filepath='external/libcxx/include/vector' line='485' column='1' id='0504b998'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='3a142966' filepath='external/libcxx/include/vector' line='481' column='1' id='3a142965'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='27a9a4b2' filepath='external/libcxx/include/vector' line='488' column='1' id='9d183c7a'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='d9249d9b' filepath='external/libcxx/include/vector' line='490' column='1' id='9a1d8b11'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='a55d0f63' filepath='external/libcxx/include/vector' line='487' column='1' id='80427be6'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='f6e567a6' filepath='external/libcxx/include/vector' line='489' column='1' id='233754d5'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='496' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='502' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='049802b4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='514' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='516' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='049802b4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='518' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458c8'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='519' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458c8'/>
              <parameter type-id='049802b4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~vector' filepath='external/libcxx/include/vector' line='550' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='558' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='0cc525a4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='559' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='0cc525a4'/>
              <parameter type-id='049802b4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='565' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='1b16c61c'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='568' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='1b16c61c'/>
              <parameter type-id='049802b4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='571' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='5c52b8bf'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='579' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='0a8caa67' is-artificial='yes'/>
              <parameter type-id='5c52b8bf'/>
              <parameter type-id='049802b4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt;' size-in-bits='96' visibility='default' filepath='external/libcxx/include/vector' line='470' column='1' id='1e253049'>
          <base-class access='private' layout-offset-in-bits='0' type-id='721e3983'/>
          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='b57f8f14' filepath='external/libcxx/include/vector' line='486' column='1' id='b57f8f13'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='63812cb4' filepath='external/libcxx/include/vector' line='482' column='1' id='63812cb3'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='0504b99b' filepath='external/libcxx/include/vector' line='485' column='1' id='0504b99a'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='3a142968' filepath='external/libcxx/include/vector' line='481' column='1' id='3a142967'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='2d3a5701' filepath='external/libcxx/include/vector' line='488' column='1' id='9d183c7b'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='0a83870c' filepath='external/libcxx/include/vector' line='490' column='1' id='9a1d8b12'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='efded478' filepath='external/libcxx/include/vector' line='487' column='1' id='80427be7'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='bab30871' filepath='external/libcxx/include/vector' line='489' column='1' id='233754d6'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='496' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='502' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='049802b5'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='514' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='516' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='049802b5'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='518' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458c9'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='519' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458c9'/>
              <parameter type-id='049802b5'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~vector' filepath='external/libcxx/include/vector' line='550' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='558' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='7707f03e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='559' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='7707f03e'/>
              <parameter type-id='049802b5'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='565' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='b5ce4ba7'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='568' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='b5ce4ba7'/>
              <parameter type-id='049802b5'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='571' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='cd9bbdb9'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='579' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='c96d0971' is-artificial='yes'/>
              <parameter type-id='cd9bbdb9'/>
              <parameter type-id='049802b5'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt;' visibility='default' is-declaration-only='yes' id='3c4ae4e9'/>
        <class-decl name='vector&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::allocator&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='46767cd5'/>
        <class-decl name='vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt;' size-in-bits='96' visibility='default' filepath='external/libcxx/include/vector' line='470' column='1' id='b05cdcb7'>
          <base-class access='private' layout-offset-in-bits='0' type-id='d5b8afe1'/>
          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='b57f8f16' filepath='external/libcxx/include/vector' line='486' column='1' id='b57f8f15'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='63812cb6' filepath='external/libcxx/include/vector' line='482' column='1' id='63812cb5'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='0504b99d' filepath='external/libcxx/include/vector' line='485' column='1' id='0504b99c'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='3a14296a' filepath='external/libcxx/include/vector' line='481' column='1' id='3a142969'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='5ec92c0a' filepath='external/libcxx/include/vector' line='488' column='1' id='9d183c7c'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='5ec92c0b' filepath='external/libcxx/include/vector' line='488' column='1' id='9d183c7d'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='5f2bceeb' filepath='external/libcxx/include/vector' line='490' column='1' id='9a1d8b13'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='5f2bceec' filepath='external/libcxx/include/vector' line='490' column='1' id='9a1d8b14'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='68fdf037' filepath='external/libcxx/include/vector' line='487' column='1' id='80427be8'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='68fdf038' filepath='external/libcxx/include/vector' line='487' column='1' id='80427be9'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='b0b63972' filepath='external/libcxx/include/vector' line='489' column='1' id='233754d7'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='b0b63973' filepath='external/libcxx/include/vector' line='489' column='1' id='233754d8'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='496' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='502' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='514' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='516' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='518' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458ca'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='519' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458ca'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~vector' mangled-name='_ZNSt3__16vectorIhNS_9allocatorIhEEED2Ev' filepath='external/libcxx/include/vector' line='550' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='558' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='bf3fae58'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='559' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='bf3fae58'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='565' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='8723cba4'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='568' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='8723cba4'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='571' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='22a84077'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='579' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='22a84077'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='496' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='502' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='514' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='516' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='518' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458ca'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='519' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458ca'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~vector' filepath='external/libcxx/include/vector' line='550' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='558' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='bf3fae58'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='559' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='bf3fae58'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='565' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='8723cba5'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='568' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='8723cba5'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='571' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='22a84077'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='579' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='94829ddf' is-artificial='yes'/>
              <parameter type-id='22a84077'/>
              <parameter type-id='049802b6'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt;' size-in-bits='96' visibility='default' filepath='external/libcxx/include/vector' line='470' column='1' id='2d13208f'>
          <base-class access='private' layout-offset-in-bits='0' type-id='fd1a2199'/>
          <member-type access='private'>
            <typedef-decl name='const_pointer' type-id='b57f8f18' filepath='external/libcxx/include/vector' line='486' column='1' id='b57f8f17'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reference' type-id='63812cb8' filepath='external/libcxx/include/vector' line='482' column='1' id='63812cb7'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='0504b99f' filepath='external/libcxx/include/vector' line='485' column='1' id='0504b99e'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='3a14296c' filepath='external/libcxx/include/vector' line='481' column='1' id='3a14296b'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_iterator' type-id='82d2f516' filepath='external/libcxx/include/vector' line='488' column='1' id='9d183c7e'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_reverse_iterator' type-id='8ae647e9' filepath='external/libcxx/include/vector' line='490' column='1' id='9a1d8b15'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='iterator' type-id='998e238d' filepath='external/libcxx/include/vector' line='487' column='1' id='80427bea'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reverse_iterator' type-id='83076282' filepath='external/libcxx/include/vector' line='489' column='1' id='233754d9'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='496' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='502' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='049802b7'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='514' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='516' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='049802b7'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='518' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458cb'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='519' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='143a6b6e'/>
              <parameter type-id='a2c458cb'/>
              <parameter type-id='049802b7'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~vector' filepath='external/libcxx/include/vector' line='550' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='558' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='8c60215c'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='559' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='8c60215c'/>
              <parameter type-id='049802b7'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='565' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='fa76a338'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='568' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='fa76a338'/>
              <parameter type-id='049802b7'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='571' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='e367418f'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public'>
            <function-decl name='vector' filepath='external/libcxx/include/vector' line='579' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b712c097' is-artificial='yes'/>
              <parameter type-id='e367418f'/>
              <parameter type-id='049802b7'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <namespace-decl name='__pointer_type_imp'>
          <class-decl name='__pointer_type&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1021' column='1' id='123fea2e'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='c70198d4' filepath='external/libcxx/include/memory' line='1023' column='1' id='4d462c8a'/>
            </member-type>
          </class-decl>
        </namespace-decl>
        <typedef-decl name='string' type-id='27619c1d' filepath='external/libcxx/include/iosfwd' line='211' column='1' id='763f758e'/>
      </namespace-decl>
    </namespace-decl>
    <pointer-type-def type-id='63080be8' size-in-bits='32' id='82a8162e'/>
    <pointer-type-def type-id='dff69842' size-in-bits='32' id='b83994e0'/>
    <pointer-type-def type-id='b04db2dd' size-in-bits='32' id='1465dabd'/>
    <pointer-type-def type-id='7bb1d8e1' size-in-bits='32' id='adb8b339'/>
    <pointer-type-def type-id='606d2805' size-in-bits='32' id='0cc07935'/>
    <pointer-type-def type-id='359485b5' size-in-bits='32' id='a499e5c5'/>
    <pointer-type-def type-id='2a92430d' size-in-bits='32' id='4ed8b0dd'/>
    <pointer-type-def type-id='23f2d06f' size-in-bits='32' id='6ae37fb7'/>
    <pointer-type-def type-id='8c662fc5' size-in-bits='32' id='2fde1255'/>
    <pointer-type-def type-id='482d220b' size-in-bits='32' id='47d1f2cb'/>
    <pointer-type-def type-id='6ba1fceb' size-in-bits='32' id='0d40426b'/>
    <pointer-type-def type-id='3f8702cf' size-in-bits='32' id='8ca5b7e7'/>
    <pointer-type-def type-id='560c92f7' size-in-bits='32' id='be42202f'/>
    <pointer-type-def type-id='49eccd9d' size-in-bits='32' id='37ed344d'/>
    <pointer-type-def type-id='a3295715' size-in-bits='32' id='307ae6a5'/>
    <pointer-type-def type-id='763f758e' size-in-bits='32' id='77721b56'/>
    <pointer-type-def type-id='427e4b8a' size-in-bits='32' id='f79cba78'/>
    <pointer-type-def type-id='82a684ba' size-in-bits='32' id='21b84758'/>
    <pointer-type-def type-id='b54229ce' size-in-bits='32' id='2cc2a2b4'/>
    <pointer-type-def type-id='ff70dc94' size-in-bits='32' id='fbd34862'/>
    <pointer-type-def type-id='0e839744' size-in-bits='32' id='d32daf72'/>
    <pointer-type-def type-id='cdd69b5c' size-in-bits='32' id='a1bcde0a'/>
    <pointer-type-def type-id='b9fa8f40' size-in-bits='32' id='38ec2026'/>
    <pointer-type-def type-id='5417a89c' size-in-bits='32' id='f0e86b2a'/>
    <pointer-type-def type-id='2f680da0' size-in-bits='32' id='efee7846'/>
    <pointer-type-def type-id='9360eadc' size-in-bits='32' id='719a934a'/>
    <pointer-type-def type-id='a3eca172' size-in-bits='32' id='46ab91d0'/>
    <pointer-type-def type-id='444756ca' size-in-bits='32' id='56fab488'/>
    <pointer-type-def type-id='9c9ad7b0' size-in-bits='32' id='f160fb56'/>
    <pointer-type-def type-id='cab02d1c' size-in-bits='32' id='bd7ee60a'/>
    <pointer-type-def type-id='d5fd3ca7' size-in-bits='32' id='35865e6f'/>
    <pointer-type-def type-id='4de8320f' size-in-bits='32' id='82ceaaa7'/>
    <pointer-type-def type-id='45e7b03b' size-in-bits='32' id='40eba30b'/>
    <pointer-type-def type-id='aa688d0f' size-in-bits='32' id='4dcecd77'/>
    <pointer-type-def type-id='8e24268f' size-in-bits='32' id='763f4b97'/>
    <pointer-type-def type-id='9f0bbb87' size-in-bits='32' id='f84d584f'/>
    <pointer-type-def type-id='255041c5' size-in-bits='32' id='afa37b15'/>
    <pointer-type-def type-id='3c4ae4e9' size-in-bits='32' id='892d0ff1'/>
    <pointer-type-def type-id='46767cd5' size-in-bits='32' id='9d474d15'/>
    <class-decl name='__sFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='8d7b2c1f'/>
    <class-decl name='native_handle' size-in-bits='96' is-struct='yes' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='34' column='1' id='3181ea79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='95e97e5e' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='numFds' type-id='95e97e5e' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numInts' type-id='95e97e5e' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='data' type-id='1fdc7fa6' visibility='default' filepath='system/core/libcutils/include/cutils/native_handle.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wctrans_t' type-id='eaa32e2f' filepath='bionic/libc/include/bits/wctype.h' line='60' column='1' id='183c72c4'/>
    <typedef-decl name='FILE' type-id='8d7b2c1f' filepath='bionic/libc/include/stdio.h' line='59' column='1' id='aa12d1bb'/>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/ObbInfo.cpp' language='LANG_C_plus_plus_14'>
    <qualified-type-def type-id='65c10d3d' const='yes' id='dda33994'/>
    <pointer-type-def type-id='dda33994' size-in-bits='32' id='a5f3e61a'/>
    <pointer-type-def type-id='aa12d1bc' size-in-bits='32' id='822cd80d'/>
    <pointer-type-def type-id='edff7cb5' size-in-bits='32' id='b5a5bc15'/>
    <pointer-type-def type-id='b5977878' size-in-bits='32' id='0657c200'/>
    <pointer-type-def type-id='a87dbeef' size-in-bits='32' id='ce9e5ae5'/>
    <pointer-type-def type-id='259563fb' size-in-bits='32' id='e7293459'/>
    <qualified-type-def type-id='783cc679' const='yes' id='44c384f0'/>
    <qualified-type-def type-id='8fc19047' const='yes' id='d452635e'/>
    <pointer-type-def type-id='d452635e' size-in-bits='32' id='b4b29456'/>
    <qualified-type-def type-id='63080be9' const='yes' id='75a12310'/>
    <qualified-type-def type-id='dff69843' const='yes' id='5be53128'/>
    <qualified-type-def type-id='b04db2de' const='yes' id='00633159'/>
    <qualified-type-def type-id='7bb1d8e2' const='yes' id='0e59eb21'/>
    <qualified-type-def type-id='606d2806' const='yes' id='cbdbf7d3'/>
    <qualified-type-def type-id='359485b6' const='yes' id='53334ee3'/>
    <qualified-type-def type-id='2a92430e' const='yes' id='b80399cb'/>
    <qualified-type-def type-id='23f2d070' const='yes' id='dcc28add'/>
    <qualified-type-def type-id='8c662fc6' const='yes' id='4db497f3'/>
    <qualified-type-def type-id='482d220c' const='yes' id='06ffb901'/>
    <qualified-type-def type-id='6ba1fcec' const='yes' id='eb2629cd'/>
    <qualified-type-def type-id='3f8702d0' const='yes' id='37aad5fb'/>
    <qualified-type-def type-id='560c92f8' const='yes' id='12d46c23'/>
    <qualified-type-def type-id='49eccd9e' const='yes' id='f53b94ff'/>
    <qualified-type-def type-id='a3295716' const='yes' id='d73e162b'/>
    <qualified-type-def type-id='763f758f' const='yes' id='17a746be'/>
    <qualified-type-def type-id='427e4b8b' const='yes' id='1dd04bda'/>
    <qualified-type-def type-id='82a684bb' const='yes' id='03a92050'/>
    <qualified-type-def type-id='b54229cf' const='yes' id='e1f2fe14'/>
    <qualified-type-def type-id='ff70dc95' const='yes' id='c508b1b2'/>
    <qualified-type-def type-id='0e839745' const='yes' id='95bfe8d2'/>
    <qualified-type-def type-id='cdd69b5d' const='yes' id='fbb12462'/>
    <qualified-type-def type-id='b9fa8f41' const='yes' id='2533de46'/>
    <qualified-type-def type-id='5417a89d' const='yes' id='8fa83eaa'/>
    <qualified-type-def type-id='2f680da1' const='yes' id='224503c6'/>
    <qualified-type-def type-id='9360eadd' const='yes' id='3e9fa922'/>
    <qualified-type-def type-id='a3eca173' const='yes' id='4f54b248'/>
    <qualified-type-def type-id='444756cb' const='yes' id='4729be00'/>
    <qualified-type-def type-id='9c9ad7b1' const='yes' id='14d1d5fe'/>
    <qualified-type-def type-id='cab02d1d' const='yes' id='99b40a0a'/>
    <qualified-type-def type-id='d5fd3ca8' const='yes' id='8dba978f'/>
    <qualified-type-def type-id='4de83210' const='yes' id='de6e0291'/>
    <qualified-type-def type-id='45e7b03c' const='yes' id='1733cb19'/>
    <qualified-type-def type-id='aa688d10' const='yes' id='14b1b7eb'/>
    <qualified-type-def type-id='8e242690' const='yes' id='3e60ea5b'/>
    <qualified-type-def type-id='9f0bbb88' const='yes' id='330d96ab'/>
    <qualified-type-def type-id='255041c6' const='yes' id='5ae3c361'/>
    <qualified-type-def type-id='3c4ae4ea' const='yes' id='e0150e19'/>
    <qualified-type-def type-id='46767cd6' const='yes' id='d8498117'/>
    <namespace-decl name='android'>
      <class-decl name='ObbInfo' size-in-bits='288' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='27' column='1' id='65c10d3d'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f8f7e309'/>
        <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mFileName' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='38' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='mPackageName' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='39' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='mVersion' type-id='3ff5601b' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='40' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='mFlags' type-id='3ff5601b' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='41' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='160'>
          <var-decl name='mSaltSize' type-id='b59d7dce' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='42' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='mSalt' type-id='9f7200cf' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='43' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='ObbInfo' mangled-name='_ZN7android7ObbInfoC1ENS_8String16ES1_iijPKh' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <parameter type-id='a3cec311'/>
            <parameter type-id='a3cec311'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='b59d7dce'/>
            <parameter type-id='9f7200cf'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD0Ev' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='writeToParcel' mangled-name='_ZNK7android7ObbInfo13writeToParcelEPNS_6ParcelE' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a5f3e61a' is-artificial='yes'/>
            <parameter type-id='1a1ddb91'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='readFromParcel' mangled-name='_ZN7android7ObbInfo14readFromParcelEPKNS_6ParcelE' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='35' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <parameter type-id='79927164'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='Parcelable' size-in-bits='32' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='35' column='1' id='f8f7e309'>
        <member-function access='public' constructor='yes'>
          <function-decl name='Parcelable' mangled-name='_ZN7android10ParcelableC2Ev' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='39' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Parcelable' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <parameter type-id='769dcc84'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Parcelable' mangled-name='_ZN7android10ParcelableD0Ev' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='37' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='writeToParcel' mangled-name='_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='6a9db9a0' is-artificial='yes'/>
            <parameter type-id='1a1ddb91'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='readFromParcel' mangled-name='_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <parameter type-id='79927164'/>
            <return type-id='a5a046cd'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='isStable' mangled-name='_ZNK7android10Parcelable8isStableEv' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='60' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='6a9db9a0' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IBinder' visibility='default' is-declaration-only='yes' id='edff7cb5'/>
      <class-decl name='IPCThreadState' visibility='default' is-declaration-only='yes' id='b5977878'/>
      <class-decl name='TextOutput' visibility='default' is-declaration-only='yes' id='32215dcb'/>
      <namespace-decl name='base'>
      </namespace-decl>
      <class-decl name='flat_binder_object' is-struct='yes' visibility='default' is-declaration-only='yes' id='8fc19047'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;' visibility='default' is-declaration-only='yes' id='27619c1e'/>
        <class-decl name='optional&lt;android::String16&gt;' visibility='default' is-declaration-only='yes' id='63080be9'/>
        <class-decl name='optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='dff69843'/>
        <class-decl name='optional&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b04db2de'/>
        <class-decl name='optional&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='7bb1d8e2'/>
        <class-decl name='optional&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='606d2806'/>
        <class-decl name='optional&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='359485b6'/>
        <class-decl name='optional&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='2a92430e'/>
        <class-decl name='optional&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='23f2d070'/>
        <class-decl name='optional&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='8c662fc6'/>
        <class-decl name='optional&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='482d220c'/>
        <class-decl name='optional&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='6ba1fcec'/>
        <class-decl name='optional&lt;std::__1::vector&lt;std::__1::optional&lt;android::String16&gt;, std::__1::allocator&lt;std::__1::optional&lt;android::String16&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='3f8702d0'/>
        <class-decl name='optional&lt;std::__1::vector&lt;std::__1::optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt;, std::__1::allocator&lt;std::__1::optional&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='560c92f8'/>
        <class-decl name='optional&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='49eccd9e'/>
        <class-decl name='optional&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='a3295716'/>
        <class-decl name='unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;' visibility='default' is-declaration-only='yes' id='427e4b8b'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='82a684bb'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b54229cf'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='ff70dc95'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='0e839745'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;double, std::__1::allocator&lt;double&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='cdd69b5d'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;float, std::__1::allocator&lt;float&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='b9fa8f41'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;int, std::__1::allocator&lt;int&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='5417a89d'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;long long, std::__1::allocator&lt;long long&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='2f680da1'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='9360eadd'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;android::String16, std::__1::default_delete&lt;android::String16&gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='a3eca173'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;, std::__1::allocator&lt;std::__1::unique_ptr&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::default_delete&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt; &gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='444756cb'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;unsigned char, std::__1::allocator&lt;unsigned char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='9c9ad7b1'/>
        <class-decl name='unique_ptr&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt;, std::__1::default_delete&lt;std::__1::vector&lt;unsigned long long, std::__1::allocator&lt;unsigned long long&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='cab02d1d'/>
        <class-decl name='vector&lt;android::String16, std::__1::allocator&lt;android::String16&gt; &gt;' visibility='default' is-declaration-only='yes' id='d5fd3ca8'/>
        <class-decl name='vector&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt;, std::__1::allocator&lt;android::base::unique_fd_impl&lt;android::base::DefaultCloser&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='4de83210'/>
        <class-decl name='vector&lt;android::sp&lt;android::IBinder&gt;, std::__1::allocator&lt;android::sp&lt;android::IBinder&gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='45e7b03c'/>
        <class-decl name='vector&lt;bool, std::__1::allocator&lt;bool&gt; &gt;' visibility='default' is-declaration-only='yes' id='aa688d10'/>
        <class-decl name='vector&lt;char16_t, std::__1::allocator&lt;char16_t&gt; &gt;' visibility='default' is-declaration-only='yes' id='8e242690'/>
        <class-decl name='vector&lt;double, std::__1::allocator&lt;double&gt; &gt;' visibility='default' is-declaration-only='yes' id='9f0bbb88'/>
        <class-decl name='vector&lt;float, std::__1::allocator&lt;float&gt; &gt;' visibility='default' is-declaration-only='yes' id='255041c6'/>
        <class-decl name='vector&lt;signed char, std::__1::allocator&lt;signed char&gt; &gt;' visibility='default' is-declaration-only='yes' id='3c4ae4ea'/>
        <class-decl name='vector&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt;, std::__1::allocator&lt;std::__1::basic_string&lt;char, std::__1::char_traits&lt;char&gt;, std::__1::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='46767cd6'/>
        <typedef-decl name='string' type-id='27619c1e' filepath='external/libcxx/include/iosfwd' line='211' column='1' id='763f758f'/>
      </namespace-decl>
    </namespace-decl>
    <pointer-type-def type-id='63080be9' size-in-bits='32' id='82a8162f'/>
    <pointer-type-def type-id='dff69843' size-in-bits='32' id='b83994e1'/>
    <pointer-type-def type-id='b04db2de' size-in-bits='32' id='1465dabe'/>
    <pointer-type-def type-id='7bb1d8e2' size-in-bits='32' id='adb8b33a'/>
    <pointer-type-def type-id='606d2806' size-in-bits='32' id='0cc07936'/>
    <pointer-type-def type-id='359485b6' size-in-bits='32' id='a499e5c6'/>
    <pointer-type-def type-id='2a92430e' size-in-bits='32' id='4ed8b0de'/>
    <pointer-type-def type-id='23f2d070' size-in-bits='32' id='6ae37fb8'/>
    <pointer-type-def type-id='8c662fc6' size-in-bits='32' id='2fde1256'/>
    <pointer-type-def type-id='482d220c' size-in-bits='32' id='47d1f2cc'/>
    <pointer-type-def type-id='6ba1fcec' size-in-bits='32' id='0d40426c'/>
    <pointer-type-def type-id='3f8702d0' size-in-bits='32' id='8ca5b7e8'/>
    <pointer-type-def type-id='560c92f8' size-in-bits='32' id='be422030'/>
    <pointer-type-def type-id='49eccd9e' size-in-bits='32' id='37ed344e'/>
    <pointer-type-def type-id='a3295716' size-in-bits='32' id='307ae6a6'/>
    <pointer-type-def type-id='763f758f' size-in-bits='32' id='77721b57'/>
    <pointer-type-def type-id='427e4b8b' size-in-bits='32' id='f79cba79'/>
    <pointer-type-def type-id='82a684bb' size-in-bits='32' id='21b84759'/>
    <pointer-type-def type-id='b54229cf' size-in-bits='32' id='2cc2a2b5'/>
    <pointer-type-def type-id='ff70dc95' size-in-bits='32' id='fbd34863'/>
    <pointer-type-def type-id='0e839745' size-in-bits='32' id='d32daf73'/>
    <pointer-type-def type-id='cdd69b5d' size-in-bits='32' id='a1bcde0b'/>
    <pointer-type-def type-id='b9fa8f41' size-in-bits='32' id='38ec2027'/>
    <pointer-type-def type-id='5417a89d' size-in-bits='32' id='f0e86b2b'/>
    <pointer-type-def type-id='2f680da1' size-in-bits='32' id='efee7847'/>
    <pointer-type-def type-id='9360eadd' size-in-bits='32' id='719a934b'/>
    <pointer-type-def type-id='a3eca173' size-in-bits='32' id='46ab91d1'/>
    <pointer-type-def type-id='444756cb' size-in-bits='32' id='56fab489'/>
    <pointer-type-def type-id='9c9ad7b1' size-in-bits='32' id='f160fb57'/>
    <pointer-type-def type-id='cab02d1d' size-in-bits='32' id='bd7ee60b'/>
    <pointer-type-def type-id='d5fd3ca8' size-in-bits='32' id='35865e70'/>
    <pointer-type-def type-id='4de83210' size-in-bits='32' id='82ceaaa8'/>
    <pointer-type-def type-id='45e7b03c' size-in-bits='32' id='40eba30c'/>
    <pointer-type-def type-id='aa688d10' size-in-bits='32' id='4dcecd78'/>
    <pointer-type-def type-id='8e242690' size-in-bits='32' id='763f4b98'/>
    <pointer-type-def type-id='9f0bbb88' size-in-bits='32' id='f84d5850'/>
    <pointer-type-def type-id='255041c6' size-in-bits='32' id='afa37b16'/>
    <pointer-type-def type-id='3c4ae4ea' size-in-bits='32' id='892d0ff2'/>
    <pointer-type-def type-id='46767cd6' size-in-bits='32' id='9d474d16'/>
    <class-decl name='__sFILE' is-struct='yes' visibility='default' is-declaration-only='yes' id='8d7b2c20'/>
    <typedef-decl name='wctrans_t' type-id='eaa32e2f' filepath='bionic/libc/include/bits/wctype.h' line='60' column='1' id='183c72c5'/>
    <typedef-decl name='FILE' type-id='8d7b2c20' filepath='bionic/libc/include/stdio.h' line='59' column='1' id='aa12d1bc'/>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/native/android/asset_manager.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <array-type-def dimensions='1' type-id='1b3b87e1' size-in-bits='512' id='224e4514'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='71ad5e8a' size-in-bits='unknown' id='86626492'>
      <subrange length='unknown' lower-bound='0' upper-bound='-1' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='2d5c5fc5' size-in-bits='512' id='98ae5868'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='char16_t' size-in-bits='16' id='801a266d'/>
    <type-decl name='char32_t' size-in-bits='32' id='a846fc93'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='16' id='49f79167'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' id='8e100159'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <class-decl name='_jarray' size-in-bits='8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='49' column='1' id='440aaf49'>
      <base-class access='public' layout-offset-in-bits='0' type-id='baffb083'/>
    </class-decl>
    <class-decl name='_jobject' size-in-bits='8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='46' column='1' id='baffb083'/>
    <array-type-def dimensions='1' type-id='bfebf634' size-in-bits='unknown' id='b51730a0'>
      <subrange length='unknown' lower-bound='0' upper-bound='-1' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <enum-decl name='jobjectRefType' filepath='libnativehelper/include_jni/jni.h' line='121' column='1' id='4f771c8a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='JNIInvalidRefType' value='0'/>
      <enumerator name='JNILocalRefType' value='1'/>
      <enumerator name='JNIGlobalRefType' value='2'/>
      <enumerator name='JNIWeakGlobalRefType' value='3'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' id='e4652d73'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <type-decl name='long double' size-in-bits='64' id='a0eb0f09'/>
    <type-decl name='long int' size-in-bits='32' id='95e97e5f'/>
    <type-decl name='long long int' size-in-bits='64' id='95e97e60'/>
    <type-decl name='short int' size-in-bits='16' id='95e97e61'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='143a6b6f' size-in-bits='96' id='69cdedfe'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='62e477ae' size-in-bits='80' id='dafbcf1a'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='7ff19f0f' id='53010e10'/>
    </array-type-def>
    <class-decl name='AAsset' size-in-bits='32' is-struct='yes' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='50' column='1' id='1fc4034c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mAsset' type-id='ac070eda' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='51' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AAsset' mangled-name='_ZN6AAssetC2ENSt3__110unique_ptrIN7android5AssetENS0_14default_deleteIS3_EEEE' filepath='frameworks/base/native/android/asset_manager.cpp' line='53' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='57d98aaa' is-artificial='yes'/>
          <parameter type-id='ac070eda'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AAssetDir' size-in-bits='96' is-struct='yes' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='39' column='1' id='ea9788c3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mAssetDir' type-id='6a6c3f8a' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mCurFileIndex' type-id='b59d7dce' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mCachedFileName' type-id='bacf3393' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='42' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AAssetDir' mangled-name='_ZN9AAssetDirC2ENSt3__110unique_ptrIN7android8AssetDirENS0_14default_deleteIS3_EEEE' filepath='frameworks/base/native/android/asset_manager.cpp' line='44' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='1cdc10c3' is-artificial='yes'/>
          <parameter type-id='6a6c3f8a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='AAssetManager' size-in-bits='8' is-struct='yes' visibility='default' filepath='frameworks/base/libs/androidfw/include/androidfw/AssetManager.h' line='36' column='1' id='7907d453'/>
    <class-decl name='JNINativeInterface' size-in-bits='7456' is-struct='yes' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='149' column='1' id='ad414f12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved0' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved3' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='GetVersion' type-id='18d755d9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='DefineClass' type-id='c1bcbe60' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='FindClass' type-id='a247d414' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='FromReflectedMethod' type-id='95094585' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='FromReflectedField' type-id='2c8531ee' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ToReflectedMethod' type-id='a19c74f7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='GetSuperclass' type-id='61e793ce' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='IsAssignableFrom' type-id='192dd735' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ToReflectedField' type-id='d17c3f88' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='Throw' type-id='c8a34da2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ThrowNew' type-id='98515169' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='ExceptionOccurred' type-id='b3dfc495' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ExceptionDescribe' type-id='8bc971a6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='ExceptionClear' type-id='8bc971a6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='FatalError' type-id='2deb20e5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='PushLocalFrame' type-id='8770ee20' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PopLocalFrame' type-id='f2a57148' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='NewGlobalRef' type-id='f2a57148' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='DeleteGlobalRef' type-id='43af461c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='DeleteLocalRef' type-id='43af461c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='IsSameObject' type-id='00722fb9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='NewLocalRef' type-id='f2a57148' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='EnsureLocalCapacity' type-id='8770ee20' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='AllocObject' type-id='32aa4f8d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='NewObject' type-id='260c4c40' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='NewObjectV' type-id='775787db' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='NewObjectA' type-id='38637da2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='GetObjectClass' type-id='f50e7349' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='IsInstanceOf' type-id='bfafe7be' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='GetMethodID' type-id='7b39afc8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='CallObjectMethod' type-id='ceea3b8d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='CallObjectMethodV' type-id='e2a33260' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='CallObjectMethodA' type-id='d469a98b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='CallBooleanMethod' type-id='dcc01f40' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='CallBooleanMethodV' type-id='f47c20db' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='CallBooleanMethodA' type-id='fb4bf8a2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='CallByteMethod' type-id='b8872911' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='CallByteMethodV' type-id='8e395004' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='CallByteMethodA' type-id='bd039867' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='CallCharMethod' type-id='276929e5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='CallCharMethodV' type-id='e6cee188' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='CallCharMethodA' type-id='75022493' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='CallShortMethod' type-id='9f2ec5e8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='CallShortMethodV' type-id='4ab10d53' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='CallShortMethodA' type-id='4ed5bc7a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='CallIntMethod' type-id='9f2ec5e9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='CallIntMethodV' type-id='4ab10d54' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='CallIntMethodA' type-id='4ed5bc7b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='CallLongMethod' type-id='9f2ec5ea' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='CallLongMethodV' type-id='4ab10d55' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='CallLongMethodA' type-id='4ed5bc7c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='CallFloatMethod' type-id='9f5f6d1f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='CallFloatMethodV' type-id='a1d47c16' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='CallFloatMethodA' type-id='81649ee5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='CallDoubleMethod' type-id='1358cb5a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='CallDoubleMethodV' type-id='061addf9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='CallDoubleMethodA' type-id='cce2541c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='CallVoidMethod' type-id='d4f446a9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='CallVoidMethodV' type-id='72df644c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='CallVoidMethodA' type-id='7359e10f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='CallNonvirtualObjectMethod' type-id='36fdf2f2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='CallNonvirtualObjectMethodV' type-id='671a4cc1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='CallNonvirtualObjectMethodA' type-id='75e166e4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='CallNonvirtualBooleanMethod' type-id='911bafcf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='CallNonvirtualBooleanMethodV' type-id='5502cec6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='CallNonvirtualBooleanMethodA' type-id='632958b5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='CallNonvirtualByteMethod' type-id='c5080c6e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='CallNonvirtualByteMethodV' type-id='ac33c16d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='CallNonvirtualByteMethodA' type-id='3f53da28' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='CallNonvirtualCharMethod' type-id='d3d606ba' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='CallNonvirtualCharMethodV' type-id='e202bf99' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='CallNonvirtualCharMethodA' type-id='429f83fc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='CallNonvirtualShortMethod' type-id='cab20a87' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='CallNonvirtualShortMethodV' type-id='5b336a8e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='CallNonvirtualShortMethodA' type-id='5b8df47d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='CallNonvirtualIntMethod' type-id='cab20a88' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='CallNonvirtualIntMethodV' type-id='5b336a8f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='CallNonvirtualIntMethodA' type-id='5b8df47e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='CallNonvirtualLongMethod' type-id='cab20a89' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='CallNonvirtualLongMethodV' type-id='5b336a90' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='CallNonvirtualLongMethodA' type-id='5b8df47f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='CallNonvirtualFloatMethod' type-id='6a09952c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='CallNonvirtualFloatMethodV' type-id='286f4f27' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='CallNonvirtualFloatMethodA' type-id='34d95ce6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='CallNonvirtualDoubleMethod' type-id='81941e91' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='CallNonvirtualDoubleMethodV' type-id='57f14084' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='CallNonvirtualDoubleMethodA' type-id='06ef81e7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='CallNonvirtualVoidMethod' type-id='f1b14db6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='CallNonvirtualVoidMethodV' type-id='e25f48c5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='CallNonvirtualVoidMethodA' type-id='59a4a320' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='GetFieldID' type-id='700bfd71' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='GetObjectField' type-id='676c304c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='GetBooleanField' type-id='afd19731' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='GetByteField' type-id='be83b1c0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='GetCharField' type-id='5b2401a4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='GetShortField' type-id='d9547e19' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='GetIntField' type-id='d9547e1a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='GetLongField' type-id='d9547e1b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='GetFloatField' type-id='45f30d62' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='GetDoubleField' type-id='a737306f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='SetObjectField' type-id='bc60df5e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='SetBooleanField' type-id='9af031fb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='SetByteField' type-id='ffc17d12' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='SetCharField' type-id='e9d4d69a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='SetShortField' type-id='aa5e90a7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='SetIntField' type-id='aa5e90a8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='SetLongField' type-id='aa5e90a9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='SetFloatField' type-id='d69f3378' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='SetDoubleField' type-id='fcbe15c5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='GetStaticMethodID' type-id='7b39afc8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='CallStaticObjectMethod' type-id='260c4c40' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='CallStaticObjectMethodV' type-id='775787db' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='CallStaticObjectMethodA' type-id='38637da2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='CallStaticBooleanMethod' type-id='59816c03' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='CallStaticBooleanMethodV' type-id='46959e4a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='CallStaticBooleanMethodA' type-id='4a68d231' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='CallStaticByteMethod' type-id='dbd5502c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='CallStaticByteMethodV' type-id='4602a027' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='CallStaticByteMethodA' type-id='39e07fe6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='CallStaticCharMethod' type-id='7cc5a858' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='CallStaticCharMethodV' type-id='8212a383' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='CallStaticCharMethodA' type-id='5316a70a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='CallStaticShortMethod' type-id='4442688b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='CallStaticShortMethodV' type-id='2b6dfd02' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='CallStaticShortMethodA' type-id='8394b669' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='CallStaticIntMethod' type-id='4442688c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='CallStaticIntMethodV' type-id='2b6dfd03' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='CallStaticIntMethodA' type-id='8394b66a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='CallStaticLongMethod' type-id='4442688d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='CallStaticLongMethodV' type-id='2b6dfd04' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='CallStaticLongMethodA' type-id='8394b66b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='CallStaticFloatMethod' type-id='b540af52' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='CallStaticFloatMethodV' type-id='aaed3ee1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4384'>
        <var-decl name='CallStaticFloatMethodA' type-id='e8cbc4c4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='CallStaticDoubleMethod' type-id='56da0ded' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='CallStaticDoubleMethodV' type-id='4d96d680' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='CallStaticDoubleMethodA' type-id='fcb05c6b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='CallStaticVoidMethod' type-id='35958544' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='CallStaticVoidMethodV' type-id='063cc4af' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='CallStaticVoidMethodA' type-id='7399468e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='GetStaticFieldID' type-id='700bfd71' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='GetStaticObjectField' type-id='4bcddc31' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='GetStaticBooleanField' type-id='c61bcf16' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4704'>
        <var-decl name='GetStaticByteField' type-id='f02d21bd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='GetStaticCharField' type-id='3a544209' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4768'>
        <var-decl name='GetStaticShortField' type-id='826b5ede' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='GetStaticIntField' type-id='826b5edf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='GetStaticLongField' type-id='826b5ee0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='GetStaticFloatField' type-id='2525f167' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4896'>
        <var-decl name='GetStaticDoubleField' type-id='8820c0ac' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='SetStaticObjectField' type-id='01a865d1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='SetStaticBooleanField' type-id='a1ed8fac' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='SetStaticByteField' type-id='d5efc015' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5024'>
        <var-decl name='SetStaticCharField' type-id='400806b7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='SetStaticShortField' type-id='48f9101c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5088'>
        <var-decl name='SetStaticIntField' type-id='48f9101d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='SetStaticLongField' type-id='48f9101e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5152'>
        <var-decl name='SetStaticFloatField' type-id='192b003b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='SetStaticDoubleField' type-id='6c7c35c0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='NewString' type-id='21ec59f0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='GetStringLength' type-id='814cad27' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5280'>
        <var-decl name='GetStringChars' type-id='a4d189fd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ReleaseStringChars' type-id='6fd868db' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5344'>
        <var-decl name='NewStringUTF' type-id='629338b7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='GetStringUTFLength' type-id='814cad27' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5408'>
        <var-decl name='GetStringUTFChars' type-id='653ec4e7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='ReleaseStringUTFChars' type-id='f48e25c1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5472'>
        <var-decl name='GetArrayLength' type-id='3c0c03e5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='NewObjectArray' type-id='3a73b9e7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5536'>
        <var-decl name='GetObjectArrayElement' type-id='3426ab68' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='SetObjectArrayElement' type-id='177b60ba' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5600'>
        <var-decl name='NewBooleanArray' type-id='2ab62f6f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='NewByteArray' type-id='2dc018ad' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5664'>
        <var-decl name='NewCharArray' type-id='843cef5f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='NewShortArray' type-id='730c485d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='NewIntArray' type-id='87d7d6ca' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='NewLongArray' type-id='adc7abf9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5792'>
        <var-decl name='NewFloatArray' type-id='8fe62605' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='NewDoubleArray' type-id='ef68ddae' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5856'>
        <var-decl name='GetBooleanArrayElements' type-id='03556b0c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='GetByteArrayElements' type-id='bec89ede' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5920'>
        <var-decl name='GetCharArrayElements' type-id='679b55be' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='GetShortArrayElements' type-id='80456268' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5984'>
        <var-decl name='GetIntArrayElements' type-id='7b7de9b2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='GetLongArrayElements' type-id='20c01846' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6048'>
        <var-decl name='GetFloatArrayElements' type-id='190d83bc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='GetDoubleArrayElements' type-id='8fb656fe' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6112'>
        <var-decl name='ReleaseBooleanArrayElements' type-id='69aab5c3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='ReleaseByteArrayElements' type-id='6d8c64bd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6176'>
        <var-decl name='ReleaseCharArrayElements' type-id='0f8e37bd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='ReleaseShortArrayElements' type-id='89ccc593' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='ReleaseIntArrayElements' type-id='66b73f2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='ReleaseLongArrayElements' type-id='4ae3250d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='ReleaseFloatArrayElements' type-id='298dc3b7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='ReleaseDoubleArrayElements' type-id='db388837' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6368'>
        <var-decl name='GetBooleanArrayRegion' type-id='fbe0c9de' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='GetByteArrayRegion' type-id='5bf36468' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6432'>
        <var-decl name='GetCharArrayRegion' type-id='730be8b4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='GetShortArrayRegion' type-id='b95eace2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='GetIntArrayRegion' type-id='6bc23226' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='GetLongArrayRegion' type-id='ad1ea7c0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6560'>
        <var-decl name='GetFloatArrayRegion' type-id='eb01d38a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='GetDoubleArrayRegion' type-id='fd9a9816' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6624'>
        <var-decl name='SetBooleanArrayRegion' type-id='08a2f0e1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='SetByteArrayRegion' type-id='3b7e394d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='SetCharArrayRegion' type-id='dc329231' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='SetShortArrayRegion' type-id='5fc46b11' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='SetIntArrayRegion' type-id='fa46db69' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='SetLongArrayRegion' type-id='ebf40e2d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='SetFloatArrayRegion' type-id='9990734d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='SetDoubleArrayRegion' type-id='977cec7b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6880'>
        <var-decl name='RegisterNatives' type-id='dfa383fd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='UnregisterNatives' type-id='55811db2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6944'>
        <var-decl name='MonitorEnter' type-id='7a154085' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='MonitorExit' type-id='7a154085' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7008'>
        <var-decl name='GetJavaVM' type-id='a65198e8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='GetStringRegion' type-id='7a8e54fc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7072'>
        <var-decl name='GetStringUTFRegion' type-id='0a719884' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='GetPrimitiveArrayCritical' type-id='101b8c80' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7136'>
        <var-decl name='ReleasePrimitiveArrayCritical' type-id='4382c817' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='GetStringCritical' type-id='a4d189fd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7200'>
        <var-decl name='ReleaseStringCritical' type-id='6fd868db' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='NewWeakGlobalRef' type-id='f2a57148' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='DeleteWeakGlobalRef' type-id='43af461c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='ExceptionCheck' type-id='22b63871' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7328'>
        <var-decl name='NewDirectByteBuffer' type-id='e8dccc6b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='GetDirectBufferAddress' type-id='4db2cf0c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7392'>
        <var-decl name='GetDirectBufferCapacity' type-id='7a154086' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='GetObjectRefType' type-id='ddfe5d59' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='480' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JNIEnv' size-in-bits='32' is-struct='yes' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='489' column='1' id='c9459134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='functions' type-id='e48f1427' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='491' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='GetLongField' mangled-name='_ZN7_JNIEnv12GetLongFieldEP8_jobjectP9_jfieldID' filepath='libnativehelper/include_jni/jni.h' line='707' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='71bed232' is-artificial='yes'/>
          <parameter type-id='96f3d089'/>
          <parameter type-id='1f3810cb'/>
          <return type-id='c8745fdc'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='IsInstanceOf' mangled-name='_ZN7_JNIEnv12IsInstanceOfEP8_jobjectP7_jclass' filepath='libnativehelper/include_jni/jni.h' line='586' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='71bed232' is-artificial='yes'/>
          <parameter type-id='96f3d089'/>
          <parameter type-id='70de5c42'/>
          <return type-id='cc6e09ca'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='CallIntMethod' mangled-name='_ZN7_JNIEnv13CallIntMethodEP8_jobjectP10_jmethodIDz' filepath='libnativehelper/include_jni/jni.h' line='622' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='71bed232' is-artificial='yes'/>
          <parameter type-id='96f3d089'/>
          <parameter type-id='38565182'/>
          <parameter is-variadic='yes'/>
          <return type-id='0b9c02cb'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='FindClass' mangled-name='_ZN7_JNIEnv9FindClassEPKc' filepath='libnativehelper/include_jni/jni.h' line='502' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='71bed232' is-artificial='yes'/>
          <parameter type-id='80f4b756'/>
          <return type-id='70de5c42'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='NewGlobalRef' mangled-name='_ZN7_JNIEnv12NewGlobalRefEP8_jobject' filepath='libnativehelper/include_jni/jni.h' line='547' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='71bed232' is-artificial='yes'/>
          <parameter type-id='96f3d089'/>
          <return type-id='96f3d089'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='GetMethodID' mangled-name='_ZN7_JNIEnv11GetMethodIDEP7_jclassPKcS3_' filepath='libnativehelper/include_jni/jni.h' line='589' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='71bed232' is-artificial='yes'/>
          <parameter type-id='70de5c42'/>
          <parameter type-id='80f4b756'/>
          <parameter type-id='80f4b756'/>
          <return type-id='38565182'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ldiv_t' size-in-bits='64' is-struct='yes' naming-typedef-id='30397bf8' visibility='default' filepath='bionic/libc/include/stdlib.h' line='136' column='1' id='9b5926fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/stdlib.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/stdlib.h' line='138' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='f5fa3b34' visibility='default' filepath='bionic/libc/include/stdlib.h' line='143' column='1' id='649cba4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='95e97e60' visibility='default' filepath='bionic/libc/include/stdlib.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='95e97e60' visibility='default' filepath='bionic/libc/include/stdlib.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mbstate_t' size-in-bits='32' is-struct='yes' naming-typedef-id='3d7d8cbf' visibility='default' filepath='bionic/libc/include/bits/mbstate_t.h' line='42' column='1' id='a76d8e48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__seq' type-id='09001d3c' visibility='default' filepath='bionic/libc/include/bits/mbstate_t.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pthread_mutex_t' size-in-bits='32' is-struct='yes' naming-typedef-id='7a6844eb' visibility='default' filepath='bionic/libc/include/bits/pthread_types.h' line='72' column='1' id='92fa54c8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default' filepath='bionic/libc/include/bits/pthread_types.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='352' is-struct='yes' visibility='default' filepath='bionic/libc/include/time.h' line='46' column='1' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tm_gmtoff' type-id='95e97e5f' visibility='default' filepath='bionic/libc/include/time.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default' filepath='bionic/libc/include/time.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='AAsset' type-id='1fc4034c' filepath='frameworks/native/include/android/asset_manager.h' line='73' column='1' id='d27ea7e1'/>
    <typedef-decl name='AAssetDir' type-id='ea9788c3' filepath='frameworks/native/include/android/asset_manager.h' line='64' column='1' id='e6c9fab0'/>
    <typedef-decl name='AAssetManager' type-id='7907d453' filepath='frameworks/native/include/android/asset_manager.h' line='54' column='1' id='f41387f0'/>
    <typedef-decl name='JNIEnv' type-id='c9459134' filepath='libnativehelper/include_jni/jni.h' line='139' column='1' id='d357872a'/>
    <typedef-decl name='JNINativeMethod' type-id='92fa54c8' filepath='libnativehelper/include_jni/jni.h' line='132' column='1' id='b7b5d51d'/>
    <typedef-decl name='__builtin_va_list' type-id='30357e0a' id='7f896fb4'/>
    <typedef-decl name='__int16_t' type-id='95e97e61' filepath='bionic/libc/include/stdint.h' line='38' column='1' id='03896e23'/>
